{
    "Sr/Jr AI Engineer (Prompt Engineer Open AI)) @ Silicon Prime Labs": {
        "id": 0,
        "title": "Sr/Jr AI Engineer (Prompt Engineer Open AI))",
        "company": "Silicon Prime Labs",
        "jd_text": "\n\nSilicon Prime Labs\n\n \n\n     68 Bach Dang, Tan Binh, Ho Chi Minh \n    \n\n       Hybrid\n      \n\n     Posted 15 hours ago \n    \n\n     Skills: \n     Python \nJavaScript \n\nTop 3 reasons to join us\n\nWork with Silicon Valley team\nNewest techs\nMultiple projects\n\nJob description\n\n     We are seeking an AI Engineer to join our dynamic team. The ideal candidate will have extensive experience in developing and deploying AI chatbots capable of handling a wide range of user inquiries before escalating to a human assistant. Your role will be crucial in training the chatbot to understand and respond to user questions swiftly and effectively, ensuring a seamless user experience.\n   \n\n Responsibilities:\n\n Develop and implement AI-powered chatbot solutions to assist users.\nTrain the chatbot to understand and respond accurately to user inquiries based on a comprehensive knowledge base.\nStructure and design prompt engineering to enhance the AI model's understanding and interpretation of user instructions.\nEnsure the chatbot interactions are intuitive, user-friendly, and visually appealing.\nIntegrate the chatbot with OpenAI GPT and other relevant AI models to improve response accuracy and efficiency\nCollaborate with UI/UX designers to create an engaging and easy-to-navigate user interface for the chatbot.\n\nYour skills and experience\n\nBachelor’s or Master’s degree in Computer Science, Artificial Intelligence, or a related field.\nProven experience in developing AI chatbots, particularly in the area of government aid applications or similar domains.\nExtensive practical experience in prompt engineering, with a deep understanding of structuring instructions for AI models.\n\nWhy you'll love working here\n\nFREE coffee, snacks, parking fee, no dress code required.\nTeam building, company trip, annual health check, monthly party.\nHave flexible working time from Monday to Friday, work from home.\nPersonal care: birthday, wedding, child-birth, women day, children day...\nAccident & healthcare 24/24 for employee and relatives\nSeniority allowance\nGame/sport activities\nInternal training and experience sharing\nBe professional and be your own boss environment\nOnsite opportunity working in the U.S.\nWork with Silicon Valley Startup team from Stanford, excellent people and challenging technical projects.\nProject bonus and 13th salary\nAnd a whole lot more!\n\nSilicon Prime Labs\n\n   USA Mobile and Web App Development Company \n  \n\n    Company type \n   \n\n    IT Outsourcing \n   \n\n    Company industry \n   \n\n     N/A \n    \n\n    Company size \n   \n\n    51-150 employees \n   \n\n    Country \n   \n\n     United States\n    \n\n    Working days \n   \n\n    Monday - Friday \n   \n\n    Overtime policy \n   \n\n    Extra salary for OT\n   \n\n",
        "jd_num_tokens": 367
    },
    "Operation Transformation Officer – Process Automation @ Dai-ichi Life Việt Nam": {
        "id": 1,
        "title": "Operation Transformation Officer – Process Automation",
        "company": "Dai-ichi Life Việt Nam",
        "jd_text": "\n\nDai-ichi Life Việt Nam\n\n \n\n     Opal Tower – 8th Floor, 92 Nguyen Huu Canh, Binh Thanh, Ho Chi Minh \n    \n\n       At office\n      \n\n     Posted 19 hours ago \n    \n\n     Skills: \n     Project Manager \nEnglish \nData Analyst \n\nJob description\n\n 1. JOB PURPOSE\n\n     Develop and execute plans to efficiently implement strategic projects for the Operations Division within specified timelines. Gather information and data from diverse sources, analyze it, and interpret findings to effectively monitor departmental activities. Provide timely updates to management on operational activities and future trends.\n   \n\n 2. ACCOUNTABILITIES\n\n Develop and implement plans for strategic projects within the Operations Division, including gathering user information, analyzing requirements, drafting business requirements, creating UAT plans, developing test cases, conducting UAT, and delivering to end-users.\nCollaborate with review departments to propose business/system improvements aimed at enhancing operational efficiency.\nHandle and process requests for data analysis. Utilize collected data to analyze, build, and develop reports from one or multiple systems, interpreting data into suitable information for management. Manage the reporting environment and execute and automate reports, including ad hoc reports, within specified deadlines.\n\nYour skills and experience\n\n 3. REQUIREMENTS\n\n Education & Experience\n\n Bachelor's degree or higher in one of the following fields: Mathematics, Statistics, Quantitative Economics, Mathematics - Computer Science, Artificial Intelligence, Computer Science, Management Information Systems.\nMinimum of 03 years of experience in analyzing needs and developing systems, analyzing data, and implementing/building management reports in the financial - banking - insurance industry using tools such as Power BI and others.\nDeep understanding of Life Insurance processes and systems is preferable.\nHave experience in project management (Project owner role)\n\n Technical Skills:\n\n Proficient in using statistical software/modeling/building data management: SPSS, SQL, Oracle, R, Python, etc.\nGood data processing skills (Excel, Access...)\nProficient in drafting documents and procedures\nNegotiation skills, good presentation skills\nPlanning and time management skills\nAnalytical and problem-solving skills\n\n Soft Skills:\n\n Teamwork skills\nGood English communication (spoken and written)\nMandatory self-learning and research ability\n\n Personal Attributes:\n\n Positive working attitude\nResult-oriented\nAble to work independently with a high level of responsibility.\n\n 4. CHALLENGES\n\n Multitasking projects, enhancements, and production issues concurrently\nWorking in high-pressure situations\n\nWhy you'll love working here\n\nSalary for 13th month, Bonus & Special Bonus\nFull of social welfare under Vietnamese Labor Law (Insurance, annual leave, ...)\nHealthcare for yourself & Your Family\nAnnual travel and team building activities\n15-16 annual leave days\nCompany will buy Life Insurance Contract for yourself after 1 year working\nTraining: Trained in soft and technical skills\nInternational, challenging, and friendly working environment\n\nDai-ichi Life Việt Nam\n\n   Dai-ichi Life Việt Nam\n  \n\n    Company type \n   \n\n    IT Product \n   \n\n    Company industry \n   \n\n     N/A \n    \n\n    Company size \n   \n\n    1000+ employees \n   \n\n    Country \n   \n\n     Japan\n    \n\n    Working days \n   \n\n    Monday - Friday \n   \n\n    Overtime policy \n   \n\n    Extra salary for OT\n   \n\n",
        "jd_num_tokens": 439
    },
    "AI ENGINEER @ Nexcel Solutions": {
        "id": 2,
        "title": "AI ENGINEER",
        "company": "Nexcel Solutions",
        "jd_text": "\n\nwho qualifies for this role? \n\nDo you excel at algorithms? \nA relentless solutions seeker? \nA person who is in love with artificial intelligence? \n\n      YES?\n     \n\n      Congratulations! You got this!\n     \n\nwhere your passion finds purposes \nWe fully entrust you with these responsibilities:\n\nIdentify and understand the business requirements at hand. \nResearch and experiment with multiple machine learning algorithms from various sources to determine the best solution that satisfies the requirement. \nClean and transform data, ensure that data is well-organized and ready for the AI model to interpret and process. \nDesigning, planning, developing, implementing, and maintaining artificial intelligence, deep learning, and machine learning against business requirements. \nInnovate product areas with the power of AI to drive business results. \nPerform iterative testing and experiment improvement to get the state of art results. Improve the AI model until it is ready for the production environment. \n     \n\nyour qualifications and skills \n\nExperienced in machine learning, deep learning algorithms, and statistics. \nDeep understanding of S.O.L.I.D principles and know how to write Clean Code. \nSkilled in one of the following programming languages: Python, Java, Scala, R or other equivalent languages. \nKnowledge of AI frameworks and libraries such as TensorFlow, Pytorch, Keras, and MLlib. \nAbility to formulate a research problem, design, experiment, and implement solutions. \nExpert at supervised and unsupervised machine learning algorithms. \nExperience in data processing and transformation. \nProficient in building and deploying models in production. \nHave demonstrated creative and critical thinking with an innate drive to improve how things work. \nEffective time management and prioritization skills. \nGood verbal/written communication and interpersonal skills. \n\n      BONUS POINTS\n     \n\nData Mining experience is a plus. \n\nBachelor’s degree in IT/Computer Science/Information Systems or equivalent hands-on experience in software companies. \nAt least 2+ years of proven experience in AI Engineer position. \nGood command of written and spoken English. \n\nwhat you will enjoy \n\n     Competitive Salary \n    \n\n     Rewards & Recognitions \n    \n\n     Premium Healthcare \n    \n\n     Meals & Refreshments \n    \n\n     Transparent Career Path \n    \n\n     Team-building Activities \n    \n\n     Sport Facilities \n    \n\nwhere you will be working at \n\n    SMS Tower\n   \nLot 40, Quang Trung Software City, Tan Chanh Hiep Ward, District 12, Ho Chi Minh City\n\n",
        "jd_num_tokens": 338
    },
    "Server Assembly Technician (Hardware/Electronics) @ East Agile": {
        "id": 3,
        "title": "Server Assembly Technician (Hardware/Electronics)",
        "company": "East Agile",
        "jd_text": "\n\nEast Agile\n\n \n\n     16 Tam Dao, District 10, Ho Chi Minh \n    \n\n       At office\n      \n\n     Posted 4 days ago \n    \n\n     Skills: \n     Assembly \nSystem Engineer \n\nTop 3 reasons to join us\n\nBest agile environment\nTalented developers\nHigh salary with HR review every 6 months\n\nJob description\n\n Job Description\n\n     We are seeking a skilled and experienced Server Assembly Technician to join our team building artificial intelligence (AI) solutions. The ideal candidate will be responsible for assembling high-performance AI servers from parts, handling a range of assembly tasks, and designing basic systems. The technician will work closely with our AI engineering team to ensure the servers are built to the required specifications and standards for AI workflows.\n   \n\n Chúng tôi đang tìm kiếm một Kỹ thuật viên Lắp ráp Máy chủ có kỹ năng và kinh nghiệm để gia nhập đội ngũ phát triển các giải pháp Trí tuệ Nhân tạo (AI) của chúng tôi. Ứng viên lý tưởng sẽ chịu trách nhiệm lắp ráp các máy chủ AI hiệu năng cao từ các bộ phận, xử lý một loạt các công việc lắp ráp và thiết kế các hệ thống cơ bản. Kỹ thuật viên sẽ làm việc chặt chẽ với đội ngũ kỹ sư AI của chúng tôi để đảm bảo rằng các máy chủ được xây dựng đạt đúng các thông số kỹ thuật và tiêu chuẩn cần thiết cho quy trình làm việc của AI.\n   \n\n Key Responsibilities\n\n     1. Assemble servers from parts, following established procedures and guidelines\n   \n\n     2. Interpret technical diagrams, schematics, and instructions to ensure accurate assembly\n   \n\n     3. Install and configure server components, including ASUS WRX90 motherboards, AMD Ryzen Threadripper CPUs, NVMe memory, SAS RAID, redundant power supplies, heatsinks, and cooling fans\n   \n\n     4. Perform basic system design tasks, such as selecting compatible components and optimizing server configurations for AI workloads\n   \n\n     5. Conduct thorough testing and quality control checks to ensure the assembled servers are functioning correctly\n   \n\n     6. Troubleshoot and resolve hardware-related issues during the assembly process\n   \n\n     7. Maintain a clean and organized work environment, ensuring proper handling and storage of server components\n   \n\n     8. Collaborate with the IT team to understand project requirements and provide input on server configurations\n   \n\n     9. Stay up-to-date with the latest server hardware technologies and assembly best practices\n   \n\n 1. Lắp ráp máy chủ từ các bộ phận, tuân theo các quy trình và hướng dẫn đã được thiết lập\n   \n\n     2. Giải thích các biểu đồ kỹ thuật, sơ đồ mạch, và hướng dẫn để đảm bảo việc lắp ráp chính xác\n   \n\n     3. Cài đặt và cấu hình các bộ phận máy chủ, bao gồm bo mạch chủ ASUS WRX90, CPU AMD Ryzen Threadripper, bộ nhớ NVMe, SAS RAID, nguồn điện dự phòng, tản nhiệt và quạt làm mát\n   \n\n     4. Thực hiện các nhiệm vụ thiết kế hệ thống cơ bản, như chọn lựa các bộ phận tương thích và tối ưu hóa cấu hình máy chủ cho tải công việc AI\n   \n\n     5. Thực hiện kiểm tra và kiểm soát chất lượng kỹ lưỡng để đảm bảo máy chủ được lắp ráp hoạt động chính xác\n   \n\n     6. Khắc phục và giải quyết các vấn đề liên quan đến phần cứng trong quá trình lắp ráp\n   \n\n     7. Duy trì một môi trường làm việc sạch sẽ và có tổ chức, đảm bảo việc xử lý và lưu trữ các bộ phận máy chủ một cách phù hợp\n   \n\n     8. Hợp tác với đội ngũ IT để hiểu rõ yêu cầu dự án và đưa ra những đề xuất về cấu hình máy chủ\n   \n\n     9. Cập nhật liên tục với các công nghệ phần cứng máy chủ và các phương pháp lắp ráp tốt nhất mới nhất\n   \n\nYour skills and experience\n\n Required Qualifications\n\n     1. Proven experience in assembling servers or high-end gaming computers from parts, with a strong understanding of hardware components\n   \n\n     2. Familiarity with server chassis, rackmount cases and rails, power supplies, motherboards, CPUs, memory, storage devices, and expansion cards\n   \n\n     3. Experience building systems with components similar to ASUS WRX90 motherboards, AMD Ryzen Threadripper CPUs, NVMe memory, and SAS RAID\n   \n\n     4. Ability to read and interpret technical diagrams, schematics, and instructions\n   \n\n     5. Experience with power management and proper power distribution in high-performance servers\n   \n\n     6. Knowledge of power consumption calculations and sizing power supplies appropriately\n   \n\n     7. Understanding of electrical safety practices and precautions when working with server components\n   \n\n     8. Strong problem-solving skills and attention to detail\n   \n\n     9. Excellent manual dexterity and hand-eye coordination\n   \n\n     10. Ability to work independently and as part of a team\n   \n\n     11. Adequate communication skills to collaborate with IT professionals\n   \n\n     12. Ability to understand technical documentation written in English\n   \n\n 1. Kinh nghiệm chứng minh trong việc lắp ráp máy chủ hoặc máy tính chơi game cao cấp từ các bộ phận, với hiểu biết vững chắc về các bộ phận phần cứng\n   \n\n     2. Quen thuộc với vỏ máy chủ, hộp và ray lắp đặt rackmount, nguồn điện, bo mạch chủ, CPU, bộ nhớ, thiết bị lưu trữ và các thẻ mở rộng\n   \n\n     3. Kinh nghiệm xây dựng hệ thống với các bộ phận tương tự như bo mạch chủ ASUS WRX90, CPU AMD Ryzen Threadripper, bộ nhớ NVMe và SAS RAID\n   \n\n     4. Khả năng đọc và giải thích các biểu đồ kỹ thuật, sơ đồ mạch và hướng dẫn\n   \n\n     5. Kinh nghiệm về quản lý năng lượng và phân phối năng lượng phù hợp trong máy chủ hiệu suất cao\n   \n\n     6. Kiến thức về việc tính toán tiêu thụ năng lượng và chọn kích cỡ nguồn điện một cách phù hợp\n   \n\n     7. Hiểu biết về các thực hành và biện pháp phòng ngừa an toàn điện khi làm việc với các bộ phận máy chủ\n   \n\n     8. Kỹ năng giải quyết vấn đề mạnh mẽ và chú trọng đến chi tiết\n   \n\n     9. Kỹ năng vận động tay và phối hợp mắt tay xuất sắc\n   \n\n     10. Khả năng làm việc độc lập và làm việc nhóm\n   \n\n     11. Kỹ năng giao tiếp đủ tốt để hợp tác với các chuyên gia IT\n   \n\n     12. Khả năng hiểu được tài liệu kỹ thuật bằng tiếng Anh\n   \n\n Preferred Qualifications\n\n     (not required)\n   \n\n     1. Experience with basic soldering and building small components\n   \n\n     2. Knowledge of server operating systems and software configurations\n   \n\n     3. Familiarity with server rack mounting and cable management techniques\n   \n\n     4. CompTIA A+ or Server+ certification\n   \n\n     5. Provide photographs of systems you have buit.\n   \n\n 1. Kinh nghiệm về hàn cơ bản và lắp ráp các bộ phận nhỏ\n   \n\n     2. Kiến thức về hệ điều hành máy chủ và cấu hình phần mềm\n   \n\n     3. Quen thuộc với kỹ thuật lắp đặt rack máy chủ và quản lý dây cáp\n   \n\n     4. Chứng chỉ CompTIA A+ hoặc Server+\n   \n\n     5. Cung cấp ảnh của các hệ thống bạn đã xây dựng.\n   \n\n We encourage candidates with a strong background in server assembly or high-end gaming computer building and a passion for working with hardware to apply. Experience with AI workflows is a plus but not mandatory. We are an equal opportunity employer and welcome all qualified applicants who meet the required qualifications.\n   \n\n Chúng tôi khuyến khích các ứng viên có nền tảng vững chắc trong việc lắp ráp máy chủ hoặc xây dựng máy tính chơi game cao cấp và đam mê làm việc với phần cứng nộp đơn. Kinh nghiệm với quy trình làm việc AI là một lợi thế nhưng không bắt buộc. Chúng tôi là một nhà tuyển dụng cơ hội bình đẳng và chào đón tất cả các ứng viên đủ điều kiện đáp ứng được các yêu cầu cần thiết.\n   \n\n Skill tags\n\n     Hardware - Phần cứng máy tính\n   \n\n     Electronics - Điện tử\n   \n\n     Electrical - Điện\n   \n\n     Electrical/Electronics - Điện/Điện tử\n   \n\n     IT system & Devices - Hệ thống và thiết bị CNTT\n   \n\n     Hardware Engineer - Kỹ sư phần cứng\n   \n\n     Engineering & Sciences > Electrical/Electronic\n   \n\nWhy you'll love working here\n\n     The East Agile Experience includes:\n   \n\n     (1) ability to transfer between our offices Ho Chi Minh City, and Da Nang,\n     (2) 15 days annual leave,\n     (3) excellent health insurance,\n     (4) a 40-hour regular work week with little or no after-hours work requirements,\n     (5) end-of-year Tet bonus,\n     (6) a fun and flexible working environment in a modern office,\n     (7) free office lunch,\n     (8) salary reviews every 6 months,\n     (9) business trips for meetings with clients in North America.\n   \n\nEast Agile\n\n   Vietnam's first and purest agile software development firm\n  \n\n    Company type \n   \n\n    IT Outsourcing \n   \n\n    Company industry \n   \n\n     N/A \n    \n\n    Company size \n   \n\n    51-150 employees \n   \n\n    Country \n   \n\n     United States\n    \n\n    Working days \n   \n\n    Monday - Friday \n   \n\n    Overtime policy \n   \n\n    No OT\n   \n\n",
        "jd_num_tokens": 1398
    },
    "[Remote] Software Developer (ASP.NET, .NET, C#) @ MICROTEL TECHNOLOGY PTE LTD": {
        "id": 4,
        "title": "[Remote] Software Developer (ASP.NET, .NET, C#)",
        "company": "MICROTEL TECHNOLOGY PTE LTD",
        "jd_text": "\n\nMICROTEL TECHNOLOGY PTE LTD\n\n \n\n     Remote, District 4, Ho Chi Minh \n    \n\n     Remote, Hoan Kiem, Ha Noi \n    \n\n       Remote\n      \n\n     Posted 20 days ago \n    \n\n     Skills: \n     ASP.NET \n.NET \nC# \n\nJob description\n\n     Since 2000, Microtel Technology has been in the forefront of providing Customer Engagement Solution (CES) in the region. We provide a wide array of CES ranging from Contact Center Infrastructure, Unified Communications, Customer Relationship Management (CRM) and Artificial Intelligence (AI) Solutions. We are now looking for motivated and driven individuals to join our dynamic team in Microtel.\n   \n\n Software Developer (Remote)\n\n Responsibilities\n\n Handle technical support issues of Microtel Solutions.\nAble to analyze, troubleshoot and isolate the raised issues.\nAnalyse process/program specifications & translate specifications to program codes, conforming to program guidelines and programming best practices.\nWork closely with clients and create innovative solutions to meet company’s technical needs.\nAssist in the integration testing, system testing, User Acceptance Test & implementation activities.\nConduct research on project related topics if required.\nGood communication skills both in oral and written.\n\nYour skills and experience\n\n Requirement\n\n Diploma / Bachelor Degree in Computer Science, Information Systems or related technology.\nGood knowledge in technology (ASP .NET 7.0 or above, .Net Core & C#). \nGood knowledge in PostgreSQL programming and administration.\nGood knowledge of Node.JS and TypeScript is a plus.\nAdopt Security by Design approach.\nAdopt best practice in RESTful web API design.\nExperience in microservices architecture.\nHands-on experience with OpenID Connect (OIDC).\n\nWhy you'll love working here\n\nFriendly & professional working environment.\nCompetitive Market Rate Salary.\n14 days annual leave\n\nMICROTEL TECHNOLOGY PTE LTD\n\n   CLOUD CUSTOMER ENGAGEMENT SOLUTION\n  \n\n    Company type \n   \n\n    IT Product \n   \n\n    Company industry \n   \n\n     N/A \n    \n\n    Company size \n   \n\n    1-50 employees \n   \n\n    Country \n   \n\n     Singapore\n    \n\n    Working days \n   \n\n    Monday - Friday \n   \n\n    Overtime policy \n   \n\n    No OT\n   \n\n",
        "jd_num_tokens": 279
    },
    "Machine Learning Researcher @ Upskills Consultancy Services": {
        "id": 5,
        "title": "Machine Learning Researcher",
        "company": "Upskills Consultancy Services",
        "jd_text": "\nJob Description\n\nThis is a remote position.\n Company Description\n Upskills provides expert financial software consulting for investment banks and leading financial institutions in Asia Pacific, Middle East and Europe region. With a strong, Front to Back expertise in the cash and derivatives markets, coupled with an in-depth knowledge of financial markets technologies, we provide smart, business-wise, and efficient solutions\n\n We are seeking an ML Researcher/Applied Scientist to join our Research & Development Team in Paris. Research Scientists at Upskills lead our efforts in developing novel architecture and solutions to feed our AI-based solutions and products and produce research that aims to be published in top AI conferences. Individuals in this role are expected to be experts in areas such as artificial intelligence, machine learning, computational statistics, and applied mathematics, particularly in areas such as natural language processing/understanding, deep learning, and computer vision.\n Key Responsibilities\n\nLead and manage complex R&D or implementation projects on applied mathematics, computer science and machine learning  \nBridge the gap between the research and engineering teams by contributing research that can be applied to Upskills’s products and solutions.  \nSuggest and engage in team collaborations to meet the Research & Development Dept. goals.  \nReport and present experimental results and research findings, both internally and externally, verbally and in writing.  \nSolve technical problems using all necessary tools (code, software, etc). focus on the delivery of a solution, including interfaces, API, etc.  \nEnsure quality and the frugality of the delivered solution  \nUpon request, collaborate with other groups’ activities, including but not limited to presenting the company to new prospective clients, participating in calls and meetings, and representing Upskills in conferences/events.\n\nRequirements\n\nKEY REQUIREMENTS\n\n Master's or PhD or equivalent degree in Computer Science/ Machine Learning, Data Science or a related scientific field. \n   \n\nExperience using deep learning frameworks such as Tensorflow, Pytorch, and/or Jax.\nExcellent communication skills and collaborative spirit. NICE-TO-HAVE \nSoftware engineering experience demonstrated via previous work, contributions to open source, or coding competitions. \nML Engineering/MLOps skills \nCloud computing platforms: Microsoft Azure, AWS \nNatural Language Processing , Computer Vision or Graph Neural Network experience. \n\nBenefits\n\n   BENEFITS \n   \n\nDo something meaningful \nWorking in small, diverse teams where you can make an impact \nVaried challenges across industries \nCooperation across France and Asian offices \n\nSkill set\n\n   Machine Learning, Data Science, Python, Programming, Quantitative Analysis, Cloud Computing, ML Ops\n  \n\nI'm interested\n\nJob Information\n\nIndustry\n\n    Technology \n   \n\nRemote Job\n\nWork Experience\n\n    0-2 years\n   \n\n",
        "jd_num_tokens": 395
    },
    "Research Scientist in Machine Learning @ VinAI": {
        "id": 6,
        "title": "Research Scientist in Machine Learning",
        "company": "VinAI",
        "jd_text": "No. 25, Riverview 6, Vinhomes Goldern River, Ho Chi Minh City, Vietnam, Technopark Tower, Hanoi, Vietnam \n\n Research Scientist in Machine Learning \n\n Machine Learning (ML) group at VinAI is seeking highly qualified people for the position of Vietnam–based Research Scientist in ML. As a member of the team, you will work on some of the most challenging problems, develop novel ML solutions, and collaborate with research scientists, residents and research engineers to integrate your ideas into products. \n\n WHAT YOU’LL DO \nConduct cutting-edge research in machine learning and deep learning related to (but not limited to): generative AI (GenAI), representation learning, optimal transport, domain generalization, unsupervised learning, self–supervised learning, weakly–supervised learning, and reinforcement learning. \nPublish scientific papers in top–tier conferences on ML such as NeurIPS, ICML, ICLR, AISTATS. \nCollaborate with other lab members and visitors to develop solutions for real-world, large-scale problems. \nWHAT YOU’LL NEED \n\n Required Qualifications:\n PhD in Computer Science or related technical fields. \nExperience in Machine Learning, Algorithmic Foundations of Optimization or Machine Intelligence (Artificial Intelligence). \nExperience in C, C++, Python. \nContributions to world–class research, including publishing papers in world–leading ML venues (NeurIPS, ICML, ICRL, AISTATS). \n\n Preferred Qualifications \n\n 1. Relevant work experience, including full-time academia/industry experience or as a researcher in a lab \n2. Strong publication record, especially on GenAI \n3. Ability to design and execute on research agenda \n4. Research activities: The machine learning (ML) group is currently focusing on many of the most studied machine learning topics involving Fundamental ML for GenAI, Representation Learning, Optimal Transport, Meta–learning, Domain Adaptation, Domain Generalization, Active Learning, Bayesian Inference as well as their appropriate connections/combinations. Our research activities mainly include: \n\n Investigating novel solutions for a wide variety of the most challenging problems in machine learning. \nCollaborating with other VinAI teams (e.g., Computer Vision, NLP, Applied) to integrate research ideas into products. \nCollaborating with world–class researchers from all over the world in doing research on the related topics above \nOrganizing a weekly reading group: To explore, discuss relevant state–of–the–art work. \nPublishing research papers at top–tier conferences on AI/ML including NeurIPS, ICML, UAI, ICLR, \nAISTATS, AAAI. \nWHY YOU’LL LOVE WORK HERE \nOpportunity to apply your knowledge and research skills to make real impact to the world. \nCompensation is highly competitive and will consider the applicant’s current experience level \nWork on challenging real–world problems. \nOpportunity to continuously grow your knowledge and your leadership skills \nOpportunity to contribute, interact, share and learn from exceptionally talented colleagues \n\n Join us in cultivating a culture of continuous learning and professional growth at VinAI. \nApply now and contribute to our employees’ development journey! \n\n Contact: Interested applicants are invited to send your application to job@vinai.io \n\n Interested applicants are invited to \nsend your application to \njob@vinai.io",
        "jd_num_tokens": 444
    },
    "SENIOR RESEARCH SCIENTIST @ FPT": {
        "id": 7,
        "title": "SENIOR RESEARCH SCIENTIST",
        "company": "FPT",
        "jd_text": "\n\n    Loại hình công việc: Toàn thời gian \n\n    Đơn vị quản lý: Tập đoàn FPT\n\n    Mức lương: Lương thỏa thuận \n\n    Hạn nộp hồ sơ: 10-07-2024\n\nCHI TIẾT CÔNG VIỆC\n Responsibility\n\nDesign and conduct complex research projects, ensuring scientific rigor and innovation. \nAnalyze and interpret data, and effectively communicate findings through publications, presentations, and reports. \nCollaborate with cross-functional teams to apply research findings to real-world applications and product development. \nMentor and guide junior researchers in their research activities. \nStay abreast of latest developments in your field and incorporate new techniques and methodologies into research practices. \nContribute to the development of research proposals and secure funding from external sources. \nParticipate in academic and industry conferences, enhancing the organization's reputation in the scientific community. \nFoster a collaborative and inclusive research environment. \n\nYÊU CẦU CÔNG VIỆC\n Requirements\n\nPhD in Computer Science or related fields with a minimum of 2 years of post-doctoral research experience. \nDemonstrated track record of high-impact research in Artificial Intelligence. \nStrong publication record in peer-reviewed journals. \nExcellent analytical, problem-solving, and critical-thinking skills. \nProficient in [relevant tools, software, languages, methodologies]. \nExperience in mentoring and leading research teams. \nStrong communication skills, both written and verbal, with the ability to convey complex scientific concepts to non-expert audiences. \nProven ability to work collaboratively in a team environment and lead cross-functional projects. \n\nQUYỀN LỢI\n\nCompetitive salary and benefits package. \nOpportunities for professional growth and career advancement. \nA collaborative and supportive work environment. \nAccess to state-of-the-art facilities and resources. \nEngagement in high-impact, globally recognized research. \n\nTHÔNG TIN THAM KHẢO\n\nInterested candidates are requested to submit their resume/CV along with a cover letter explaining their suitability for the role. Please include any relevant project details, portfolios, or GitHub links that demonstrate your skills and experience in computer vision, IoT, and system development.\nFPT Corporation is an Equal Opportunity Employer. We value diversity and are committed to creating an inclusive environment for all employees.\n\nThis job description can be further tailored to align with the specific needs and vision of CADS at FPT Corporation.\n\nTìm hiểu về FPT tại đây\nQuy trình tuyển dụng tại FPT tại đây\nNƠI LÀM VIỆC: Tòa nhà Đại Minh, Số 77 Hoàng Văn Thái, Phường Tân Phú, Quận 7, TP. Hồ Chí Minh, Việt Nam\n \n\n",
        "jd_num_tokens": 371
    },
    "Sales Support Analyzer @ Yokogawa": {
        "id": 8,
        "title": "Sales Support Analyzer",
        "company": "Yokogawa",
        "jd_text": "\n\n  Not just a job, but a career\n \n\n   Yokogawa, award winner for ‘Best Asset Monitoring Technology’ and ‘Best Digital Twin Technology’ at the HP Awards, is a leading provider of industrial automation, test and measurement, information systems and industrial services in several industries.\n \n\n   Our aim is to shape a better future for our planet through supporting the energy\n   transition, (bio)technology, artificial intelligence, industrial cybersecurity, etc. We are committed to the United Nations sustainable development goals by utilizing our ability to measure and connect.\n \n\n   About the Team\n   Our 18,000 employees work in over 60 countries with one corporate mission, to \"co-innovate tomorrow\". We are looking for dynamic colleagues who share our passion for technology and care for our planet. In return, we offer you great career opportunities to grow yourself in a truly global culture where respect, value creation, collaboration, integrity, and gratitude are highly valued and exhibited in everything we do.\n \n\n   Sales Support for Analyzer\n \n\n   Yokogawa is an Equal Opportunity Employer. Yokogawa wants a diverse, equitable and inclusive culture. We will actively recruit, develop, and promote people from a variety of backgrounds who differ in terms of experience, knowledge, thinking styles, perspective, cultural background, and socioeconomic status. We will not discriminate based on race, skin color, age, sex, gender identity and expression, sexual orientation, religion, belief, political opinion, nationality, ethnicity, place of origin, disability, family relations or any other circumstances. Yokogawa values differences and enables everyone to belong, contribute, succeed, and demonstrate their full potential.\n \n\n   Are you being referred to one of our roles? If so, ask your connection at Yokogawa\n   about our Employee Referral process!\n \n",
        "jd_num_tokens": 265
    },
    "Digital AI Engineer @ VIB": {
        "id": 9,
        "title": "Digital AI Engineer",
        "company": "VIB",
        "jd_text": "\n\n    Khối / Ban\n   \n\n    Khối Ngân hàng Số\n   \n\n    Lĩnh vực\n   \n\n    Công nghệ số\n   \n\n    Địa điểm\n   \n\n    Hồ Chí Minh\n   \n\n    Loại hình công việc\n   \n\n    Fulltime (toàn thời gian)\n   \n\n    Thời hạn ứng tuyển\n   \n\n    27/06/2024\n   \n\n    Số lượng cần tuyển\n   \n\n    1\n   \n\n    Mô tả công việc\n   \n\nMục tiêu:\n Chịu trách nhiệm (i) Nghiên cứu các xu hướng và đề xuất các giải pháp, ứng dụng hoặc mô hình sử dụng Trí tuệ nhân tạo (AI)/ Dữ liệu lớn (Big Data) và các công nghệ mới vào hoạt động sản xuất kinh doanh của VIB; (ii) Thực hiện xây dựng các thuật toán và ứng dụng Artificial Intelligence & Deep Learning để cung cấp các giải pháp nghiệp vụ chuyên sâu nhằm tối ưu hóa trải nghiệm khách hàng.\n Trách nhiệm:\n\n Nghiên cứu các xu hướng và đề xuất các giải pháp, ứng dụng hoặc mô hình sử dụng Trí tuệ nhân tạo (AI)/ Dữ liệu lớn (Big Data) và các công nghệ mới (Videocall, NFC, Blockchain, AR/VR, NLP, CV...) vào hoạt động sản xuất kinh doanh của VIB;\n Tham gia tìm kiếm, thẩm định và tư vấn lựa chọn giải pháp của các đối tác và nhà cung cấp có công nghệ hiện đại, phù hợp với xu hướng chuyển đổi số;\n Phối hợp cùng các Đơn vị khác và đối tác công nghệ trong việc nghiên cứu phát triển ứng dụng giải pháp công nghệ mới;\n Thực hiện xây dựng các thuật toán và ứng dụng Artificial Intelligence & Deep Learning để cung cấp các giải pháp nghiệp vụ chuyên sâu nhằm tối ưu hóa trải nghiệm khách hàng;\n Duy trì vận hành mô hình dữ liệu và xây dựng cơ chế quản lý, theo dõi và đánh giá kết quả mô hình;\n Thực hiện các nhiệm vụ khác theo phân công của cấp quản lý.\n\n Yêu cầu:\n\n Tốt nghiệp Đại học trở lên chuyên ngành Công nghệ thông tin, Khoa học máy tính, Toán hoặc các lĩnh vực có liên quan; \nTối thiểu 7 năm (Chuyên gia)/5 năm (Chuyên viên cao cấp)/3 năm (Chuyên viên chính)/2 năm (Chuyên viên) kinh nghiệm làm việc tại các vị trí liên quan trong lĩnh vực Tài chính ngân hàng hoặc nhóm ngành Công nghệ thông tin Trí tuệ nhân tạo/ Dữ liệu lớn/ Videocall, NFC, Blockchain, AR/VR, CV, NLP, ...; \nKinh nghiệm ứng dụng Artificial Intelligence & Deep Learning liên quan đến lĩnh vực tài chính ngân hàng; \nKhả năng nghiên cứu chuyên sâu, nắm bắt nhanh các xu hướng công nghệ mới; \nKỹ năng làm việc và tư duy độc lập; \nKỹ năng làm việc theo nhóm, làm việc với đối tác; \nKỹ năng đọc hiểu các tài liệu nghiên cứu học thuật; \nKỹ năng trình bày báo cáo mô hình cho người dùng; \nKhả năng kiến trúc hệ thống là một lợi thế; \nKỹ năng Tiếng Anh thành thạo.\n\n",
        "jd_num_tokens": 473
    },
    "Indoor Sales Engineer @ Yokogawa": {
        "id": 10,
        "title": "Indoor Sales Engineer",
        "company": "Yokogawa",
        "jd_text": "\n\n  Not just a job, but a career\n \n\n   Yokogawa, award winner for ‘Best Asset Monitoring Technology’ and ‘Best Digital Twin Technology’ at the HP Awards, is a leading provider of industrial automation, test and measurement, information systems and industrial services in several industries.\n \n\n   Our aim is to shape a better future for our planet through supporting the energy\n   transition, (bio)technology, artificial intelligence, industrial cybersecurity, etc. We are committed to the United Nations sustainable development goals by utilizing our ability to measure and connect.\n \n\n   About the Team\n   Our 18,000 employees work in over 60 countries with one corporate mission, to \"co-innovate tomorrow\". We are looking for dynamic colleagues who share our passion for technology and care for our planet. In return, we offer you great career opportunities to grow yourself in a truly global culture where respect, value creation, collaboration, integrity, and gratitude are highly valued and exhibited in everything we do.\n \n\n   Job Description\n \n\n Prepare Quotation/Proposal, Bid Proposal\n Handling Project execution, Vendor documents\n Maintain relationships with existing customers & Assistant Salesman’s in developing new customers\n Continuously self-study to adapt with the volatile change of products’ changes & sales strategy\n Field instrument\n\n   Special Skills Required\n \n\n Problem-solving: identifying potentials problems and finding solutions to suite customers’ needs\n Collaboration and teamwork\n Fluent English in writing and speaking.\n Time management.\n Logical thinking, communication skill\n\n   Educational Required\n \n\n   Graduated from Technology University\n \n\n   Background: Electrical, Electronic, Automation, Mechatronics\n \n\n   Experience required:\n \n\n 1-2 years of experience in related field\n\n   Salary & Benefits:\n \n\nSalary: negotiate\n13th Salary, annual performance bonus.\nGenerali insurance (Health, Accident)\nYear End Party, Teambuilding\nMonetary allowance from Labor union in holidays\n\n   Corporate Governance and Compliance\n \n\n   All Yokogawa Employees must act with high standards of honesty, integrity, fairness and equity in all aspects of their employment with Yokogawa.\n \n\nCompliance must be fully with the content and spirit of all laws and regulations which govern the operation of Yokogawa, it's a business environment, and its employment practices.\nEmployees will not enter into any arrangement or participate in any activity that would conflict with the interests of Yokogawa or its corporate regulations nor prejudice the performance of professional duties.\nEmployees must actively promote compliance with laws, rules, regulations and the Yokogawa Compliance Guidelines and Yokogawa Australia Code of Ethics and Conduct.\n\n   Information Security\n \n\n   Yokogawa creates, collects and maintains information that is sensitive and valuable. All Yokogawa Employees must maintain the confidentiality of the Information received, either in writing or verbally, whether technical, business, legal, organizational, personal or any other information that could result in damage to Yokogawa in case of disclosure to unauthorized persons, regardless of whether the information is classified as confidential or not.\n \n\n   Employees must take all reasonable, necessary, and appropriate steps to safeguard confidentiality, integrity, and availability of the Yokogawa’s assets and information.\n \n\n   Information Security.\n \n\n   Work Health and Safety\n \n\n   All employees have a responsibility and accountability for engaging with the WHS Management System (WHSMS), their Manager and business unit personnel for the following outcomes:\n \n\nengaging with mechanisms agreed for consultation and participation on WHS matters;\nidentifying hazards and assessing risks and opportunities;\ncomplying with all relevant laws, standards, regulations, codes of practice or workplace rules with the support and guidance of your Manager(s);\ndetermining and implementing timely and effective actions to eliminate hazards and reduce WHS risks associated with or arising from work;\n\n   The work performed under the control of Yokogawa where the above applies may be performed by those employed by the organisation, external providers, contractors, individuals, agency workers, and by other persons to the extent the organisation shares control over their work or workrelated activities, according to the context of Yokogawa.\n \n\n By responding to Yokogawa’s advertisement, consent is considered given to Yokogawa to collect the required personal data for the purpose of recruitment with expectation that Yokogawa will protect personal data with security safeguards that are reasonable and appropriate to the sensitivity of the personal data, to protect it from unauthorized access, use or disclosure and complies with applicable regulatory requirements with respect to the retention of personal data\n\n   Yokogawa is an Equal Opportunity Employer. Yokogawa wants a diverse, equitable and inclusive culture. We will actively recruit, develop, and promote people from a variety of backgrounds who differ in terms of experience, knowledge, thinking styles, perspective, cultural background, and socioeconomic status. We will not discriminate based on race, skin color, age, sex, gender identity and expression, sexual orientation, religion, belief, political opinion, nationality, ethnicity, place of origin, disability, family relations or any other circumstances. Yokogawa values differences and enables everyone to belong, contribute, succeed, and demonstrate their full potential.\n \n\n   Are you being referred to one of our roles? If so, ask your connection at Yokogawa\n   about our Employee Referral process!\n \n",
        "jd_num_tokens": 774
    },
    "Project Sales Engineer @ Yokogawa": {
        "id": 11,
        "title": "Project Sales Engineer",
        "company": "Yokogawa",
        "jd_text": "\n\n  Not just a job, but a career\n \n\n   Yokogawa, award winner for ‘Best Asset Monitoring Technology’ and ‘Best Digital Twin Technology’ at the HP Awards, is a leading provider of industrial automation, test and measurement, information systems and industrial services in several industries.\n \n\n   Our aim is to shape a better future for our planet through supporting the energy transition, (bio)technology, artificial intelligence, industrial cybersecurity, etc. We are committed to the United Nations sustainable development goals by utilizing our ability to measure and connect.\n \n\n   About the Team\n   Our 18,000 employees work in over 60 countries with one corporate mission, to \"co-innovate tomorrow\". We are looking for dynamic colleagues who share our passion for technology and care for our planet. In return, we offer you great career opportunities to grow yourself in a truly global culture where respect, value creation, collaboration, integrity, and gratitude are highly valued and exhibited in everything we do.\n \n\n   Job Description:\n \n\n Find opportunities and build credibility with customers, and increase the overall performance of the organization by creating strong customer relationships and new customer partnerships within your defined area.\n Establish relationships and understand customer business to provide the appropriate product, systems, and solutions for customers.\n Achieve sales targets by developing and managing sales plans for specific products, services, or solutions using a disciplined sales process\n Provide regular status updates to sales management tool, including forecast and pipeline summaries.\n Act as the primary liaison between customers, Yokogawa support team members, and other business units to ensure clear and efficient communication.\n Quotation / tender preparation for new system sales enquiries, including:\n   \n Opportunity evaluation, prioritisation and identification of both commercial and technical risk\n Customer meetings to identify needs and evaluation of possible solutions\n Concept development of solution together with pre-project team\n Co-ordination and team leadership of all activities required to compile quotation / tender document including final editing of customer proposal document\n Development of “pitch” and presentation for quotation / tender\n Customer meetings / presentations to review quotation / tender\n\n Frequent travel is required\n\n   Yokogawa is an Equal Opportunity Employer. Yokogawa wants a diverse, equitable and inclusive culture. We will actively recruit, develop, and promote people from a variety of backgrounds who differ in terms of experience, knowledge, thinking styles, perspective, cultural background, and socioeconomic status. We will not discriminate based on race, skin color, age, sex, gender identity and expression, sexual orientation, religion, belief, political opinion, nationality, ethnicity, place of origin, disability, family relations or any other circumstances. Yokogawa values differences and enables everyone to belong, contribute, succeed, and demonstrate their full potential.\n \n\n   Are you being referred to one of our roles? If so, ask your connection at Yokogawa\n   about our Employee Referral process!\n \n",
        "jd_num_tokens": 443
    },
    "Solution Architect @ GFT Technologies SE": {
        "id": 12,
        "title": "Solution Architect",
        "company": "GFT Technologies SE",
        "jd_text": "\nWhat do we do?\nAs a pioneer for digital transformation GFT develops sustainable solutions across new technologies – from cloud engineering and artificial intelligence to blockchain/DLT. With its deep technological expertise, strong partnerships, and comprehensive market know-how GFT offers advice to the financial and insurance sectors, as well as in the manufacturing industry. Through the intelligent use of IT solutions GFT increases productivity and creates added value for clients. Companies gain easy and safe access to scalable IT-applications and innovative business models.\nWho are we?\nHaving started in Germany in 1987, GFT Technologies has grown to become a trusted Software Engineering and Consulting specialist for the international financial industry, counting many of the world’s largest and best-known Banks as our clients. We are an organization that empowers you to not only explore but raise your potential and seek out opportunities that add value. At GFT, diversity, equality, and inclusion are at the core of who we are. Ensuring a diverse and inclusive working environment for all communities is one of the main pillars of our diversity strategy, based on our core values and culture. We have been certified for 2022/23 as a ‘Great place to work’ in the APAC region. So, if you want to have the opportunity to work with an outstanding and progressive organization this position could be right for you.\n\nRole Summary \nWe are seeking a seasoned Solution Architect, based in Hanoi or Ho Chi Minh city with a minimum of 8 years of experience to join our team. The successful candidate will have a strong background in designing and implementing complex business solutions in the banking domain. You will be responsible for designing and implementing robust and scalable solutions to support our banking operations.\n\nKey Activities\n\nDesign and implement end-to-end solution architectures for transformation and modernization initiatives\nEvaluate current architectures and propose and implement appropriate technical solutions to meet business requirements\nCollaborate with stakeholders, business representatives, and subject matter experts to design IT systems and programs\nManage and coordinate efforts among various teams to ensure that project deliverables are met\nEnsure architectural integrity and consistency across the entire product\nIdentify, communicate, and mitigate Risks, Assumptions, Issues, and Decisions throughout the full lifecycle\n\n \nRequired Skills\n\nBachelor’s degree in Computer Science, Information Technology, or related field\nMinimum of 4+ years of experience in a Solution Architect role\nExperience in the banking domain is a must\nStrong knowledge of banking systems, transactions, and processes\nProficiency in modern programming languages and cloud platforms\nExcellent problem-solving skills, attention to detail, and strong interpersonal skills\nAbility to work in a fast-paced, high-effort, dynamic work environment\nStrong technical and design skills\nFast learner of new and emerging technologies\nSelf-motivated with the ability to drive features to deliver\n\n \nPreferred Skills\n\nProficiency in developing and deploying applications in a microservices architecture and event driven architectures especially strong in Java (Java, OOP, Kafka, Spring boot, etc.), with a focus on scalability, reliability, and performance optimization\nExperience in a consultative technical Sales/Pre-Sales Solution Architect role supporting revenue objectives with a proven track record of success\nExperience in managing and working with multiple technical teams\nTrack record of thought leadership or T-Shaped skills around diverse technologies like infrastructure, cloud, security, database\nExposure to any banking domain knowledge is advantageous\nExcellent written and verbal use of English\n\nWhat we offer you:\nYou will be working with some of the brightest people in business and technology on challenging and rewarding projects in a team of like-minded individuals. GFT prides itself on its international environment that promotes professional and cultural exchange and encourages further individual development with the benefits below:\n\nCompetitive salary \n13th-month salary guarantee \nPerformance bonus \nProfessional English course for employees \nPremium health insurance \nExtensive annual leave\n\nAbout Us\n We show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nWhy Choose GFT?\n\nCompetitive Compensation\nBenefits package including comprehensive medical, dental, vision and others\nCompany Culture based on our Core Values\nProfessional Development Training with Individual Development Plans to map out your career growth\nOpportunity to work in a global environment with diverse teams built with colleagues from around the world\nOpportunity to work with technology industry leaders in the financial services industry\nOpportunity to work for big name clients in capital markets, banking and other industries\n\n",
        "jd_num_tokens": 785
    },
    "Lecturer, Business & Technology @ RMIT University": {
        "id": 13,
        "title": "Lecturer, Business & Technology",
        "company": "RMIT University",
        "jd_text": "\n\n  Overview:\n \n\n     RMIT University Commitment\n   \n\n    RMIT is committed to the rights of students and staff to be safe, respected, valued, and treated as an equal in their place of study and work. All staff are expected to share this commitment and contribute to a safer community. While carrying out their role, staff are in a position of trust with students. Staff have a duty of care to report wellbeing concerns about students through the designated channels and uphold to the code of conduct. RMIT Vietnam expects all staff members to comply with its Code of Conduct, policies and procedures, which relate to legal and regulatory requirements and our ways of working.\n  \n\n     Why RMIT University Vietnam?\n   \n\n    RMIT Vietnam, an entity of RMIT University, has campuses in Ho Chi Minh City and Hanoi since 2001. We provide internationally recognized, high-quality education and professional training for students, clients, and the community, and assist in the development of human resources capability in Vietnam and the region by hosting students from Australia and many other countries.\n  \n\n       RMIT Vietnam is committed to excellence, innovation, and social responsibility. We welcome applications from qualified and passionate individuals who share our values and vision. RMIT University has a global reputation and ranks 140th globally and 11th in Australia in QS World University Rankings 2024. To learn more about our rankings, please check out our latest facts and figures here \n      \n       Reputation and rankings - RMIT University\n      \n\n       Rewards and Benefits:\n     \n\n         Competitive salary package and allowances\n       \n\n         Expatriate candidates: Generous relocation allowance. Educational support up to US$20,000 per child annually, up to 2 children per family; private insurance coverage for staff and family; annual health checkup; Work Permit for staff, Visa and temporary resident cards for family members.\n       \n\n         Expert support from our Mobility Team with regards to obtaining a work permit and visas, and with relocation and settling into living and working in Vietnam.\n       \n\n         Local candidates: 13th month Tet bonus + private medical insurance (for you and your dependents) + annual health check.\n       \n\n         Generous annual leave, career leave and public holidays (Christmas and Tet Holidays)\n       \n\n         Professional development and career advancement\n       \n\n         Access to state-of-the-art facilities and resources\n       \n\n         A vibrant and diverse campus life and more!\n       \n\n       RMIT Vietnam has been honoured with the respectable HR Asia Award as Top Employer To Work For in Asia. To find out more about RMIT Vietnam and our current vacancies, please visit our website: \n      \n       https://www.rmit.edu.vn/careers\n      \n\n   Position summary\n \n\n   The Lecturer, Business and Technology is expected to contribute to the teaching of the University, in Business and Technology discipline related to their field of expertise including:\n \n\n     Make original contributions in teaching and/or scholarship which expand knowledge or practice within the Business and Technology area, looking at various disciplines but in particular Cybersecurity Governance and Introduction to AI\n   \n\n     Undertake independent professional activities, scholarship and/or conduct high quality research activities appropriate to the profession or discipline including: managing individual projects within timelines and budgets and ensuring compliance with quality and reporting requirements; publishing research results in high quality outlets as lead or co-author; preparing and submitting external research funding applications; and supervising higher degree by research candidates.\n   \n\n     Undertake administration duties, which may include course coordination role, promoting the program, and/or management of a small award program,\n   \n\n     Adhere to the requirements of the Academic Expectations and Development Framework of RMIT Vietnam.\n   \n\n    JD - Business and Technology\n  \n\n   Key selection criteria\n \n\n     PhD or equivalent relevant Doctoral qualification.\n   \n\n     Broad and in-depth knowledge of Digital Business area such as Digital Transformation, Digital Start-ups, Business Analytics, Artificial Intelligence, Blockchain for Business, or Digital Business Development\n   \n\n     Early-career academic with good track of publications.\n   \n\n     Demonstrated ability to prepare and teach programs at undergraduate and post-graduate levels and the ability to produce high quality curriculum or program materials.\n   \n\n     Demonstrated experience or ability to undertake course coordination role.\n   \n\n     Demonstrated capacity to work effectively with and to negotiate sensitively with students especially on issues related to effective learning.\n   \n\n     Emerging track record and recognition for quality research outputs\n   \n\n     Demonstrated ability to supervise higher degree by research candidates.\n   \n\n     Excellent interpersonal and communications skills, together with a strong commitment to teamwork and multidisciplinary collaboration within and across campuses.\n   \n\n     Ability to build or demonstrate ability to build, successful networks with colleagues and generate alternative funding projects through effective liaison with industry and government.\n   \n\n   Expected research profile\n \n\n     For candidates with a PhD awarded more than 5 years ago: you will be expected to demonstrate a minimum of 2 peer reviewed journal articles, of which must be ranked in Scimago or ABDC and preferably both in Q1/A ranking or equivalent.\n   \n\n     For candidates with a PhD awarded within the last 3- 5 years although there are no requirements of peer reviewed journal articles for publication, you need to be research active in relevant research areas.\n   \n\n     For candidates with a PhD awarded within the last 3 years, although there are no requirements you are expected to be research active.\n   \n\n   Further information\n \n\n     As an expatriate candidate you will require a work permit to be employed in Vietnam. To qualify for a work permit you will need a PhD qualification and you will need to be able to demonstrate at least 3 years of teaching across relevant subjects in a tertiary education environment.\n   \n\n     English is the language of teaching and communication at RMIT Vietnam. For this role, the minimum requirement is IELTS (Academic) with a score of at least 7.0 with no competency less than 6.5 (or equivalent, as outlined in the Recruitment, Selection and Onboarding Guidelines).\n   \n\n     For Higher Education roles, English Language Proficiency may also be proven by having completed PhD studies while being instructed through the medium of English, and proof of teaching in an English-speaking environment during the previous 24 months.\n   \n\n   How to apply\n \n\n   Please click on the ‘Apply Now’ button. With your application please include:\n \n\n     Curriculum Vitae/ Resume\n   \n\n     Cover letter\n   \n\n     Qualifications\n   \n\n     Passport/ ID\n   \n\n   Applications Close:\n  29 thg 6 2024 11.59 pm\n \n\n   RMIT University Vietnam (RMIT Vietnam) is a campus of RMIT University. RMIT Vietnam is creating an innovative research, teaching and learning culture. We are committed to providing internationally recognised high-quality education and professional training for our students, clients and members of the community. As an internationally recognised Australian university based in Asia, RMIT Vietnam is assisting in the development of human resources capability in Vietnam and the region.\n \n\n    https://www.rmit.edu.vn/about-us\n  \n\n",
        "jd_num_tokens": 1039
    },
    "APAC Digital Marketing Specialist @ GFT Technologies SE": {
        "id": 14,
        "title": "APAC Digital Marketing Specialist",
        "company": "GFT Technologies SE",
        "jd_text": "\nAbout GFT\n\n GFT is driving the digital transformation of the world’s leading companies in the financial, insurance, and manufacturing sectors. As an IT services and software engineering provider, GFT offers strong consulting and development skills across all aspects of pioneering technologies, such as blockchain and distributed ledger technology, cloud engineering, artificial intelligence, mainframe modernisation and the Internet of Things for Industry 4.0.\nWe’ve been a pioneer of near-shore delivery since 2001 and now offer an international team spanning 16 countries with a global workforce of over 12,000 people around the world. GFT is recognised by industry analysts, such as Everest Group, as a leader amongst the global mid-sized Service Integrators.\n\nIn pursuit of its ambitious growth objectives in Asia Pacific, GFT is looking for a Digital Marketing Specialist to join the regional Marketing team and help to develop and enhance our brand in the market and capitalise on the extensive expertise and know-how, to generate broader brand recognition and a pipeline of new sales opportunities.\n\nResponsibilities:\n\nHelp develop and execute content marketing strategies to drive brand awareness, engagement, and lead generation across various channels, including website, social media, email, and more.\nCreate high-quality and engaging content, including articles, social media posts, videos, and infographics, that aligns with the brand's voice and resonates with the target audience.\nManage social media platforms and online communities, including content scheduling, monitoring, and responding to user engagement.\nSupport the development and implementation of the CRM Marketing Strategy to enhance customer engagement through proactive communication and marketing automation. \nMonitor and analyze marketing performance metrics, including website traffic, social media engagement, content reach, and campaign effectiveness, and provide actionable insights for continuous improvement.\nEnsure all content is optimized for search engines (SEO) and performs well in terms of readability, relevance, and conversion.\n\n \nRequired Skills and Qualifications:\n\nBachelor’s degree in Marketing, Communications/Journalism, Creative Media, or a related field.\nAt least 5 years’ experience working in marketing, communication, or in a similar field.\nExperience in IT or financial services would be a plus.\nExcellent written and verbal communication skills in English\nStrong knowledge of digital marketing tools and platforms, including social media (LinkedIn, Twitter, Youtube), email marketing (Pardot), and content marketing. \nStrong understanding of SEO principles, keyword research, and website optimization. \nProficiency in digital marketing tools and platforms, such as Google Ads, Google Analytics would be a plus. \nStrong writing and editing skills, with the ability to create compelling and persuasive content across different formats and platforms.\nGood interpersonal skills to effectively collaborate with internal teams and external vendors.\nCreative mindset with the ability to think strategically and develop innovative marketing approaches.\nSelf-motivated, detail-oriented, and able to meet deadlines in a fast-paced environment.\n\nWhat can we offer you?\n\nCompetitive salary\n13th-month salary guarantee\nPerformance bonus\nProfessional English course for employees\nPremium health insurance\nExtensive annual leave\n\nAbout Us\n We show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nWhy Choose GFT?\n\nCompetitive Compensation\nBenefits package including comprehensive medical, dental, vision and others\nCompany Culture based on our Core Values\nProfessional Development Training with Individual Development Plans to map out your career growth\nOpportunity to work in a global environment with diverse teams built with colleagues from around the world\nOpportunity to work with technology industry leaders in the financial services industry\nOpportunity to work for big name clients in capital markets, banking and other industries\n\n",
        "jd_num_tokens": 635
    },
    "Senior Machine Learning Engineer @ EPAM Systems": {
        "id": 15,
        "title": "Senior Machine Learning Engineer",
        "company": "EPAM Systems",
        "jd_text": "\n We are looking for a talented Senior Machine Learning Engineer specializing in Large Language Model (LLM) and Generative AI application development to join the team in Vietnam. The role will focus on leveraging cutting-edge language models and generative AI techniques to create innovative solutions in the retail industry. As a Senior Machine Learning Engineer, you will collaborate with cross-functional teams to design, develop, and deploy LLM-based applications.\n \n WHAT YOU’LL DO\n \n Design and develop LLM-driven applications, including chatbots with complex workflow prompts and custom tools for LLM agents\n Build data pipelines for external knowledge retrieval of LLMs\n Stay updated on the cutting-edge Generative AI technologies and integrate them into our applications\n Integrated various technology stacks to develop AI products\n Understand the requirement precisely and effectively communicate complex ideas with senior team members\n Collaborate with IT teams and project managers to support different use cases\n Implement and manage LLMOps processes, ensuring efficient deployment, monitoring and optimization of LLMs in production\n\n WHAT YOU HAVE\n \n Possess diverse experience in building products using GPT and other Large Language Models\n Proficient with LLM ecosystems and frameworks like LangChain, LlamaIndex, Langfuse, OpenAI, etc\n Have at least 3 years of experience in developing and deploying software and artificial intelligence products\n Demonstrate a strong proficiency in Python\n Familiar with data technologies such as SQL and vector databases\n Understand software engineering principles and experience in building scalable and production-ready applications\n Familiar with Azure cloud platform and system architecture of LLM solutions\n\n WHY EPAM\n \n By choosing EPAM Vietnam, you're getting a job at a Vietnam Best Workplace™ certified company (2022 & 2023)\n You'll work with the latest and most advanced technologies on exciting global projects with a supportive multicultural team where your voice matters\n We prioritize a healthy work-life balance with a flexible hybrid working model and generous annual leave of up to 19 days\n We offer a transparent career path and an individual roadmap to engineer your future & accelerate your journey\n At EPAM, you can find vast opportunities for self-development: 17,000+ online courses and libraries, English classes, mentoring programs, partial grants of certification, and experience exchange with colleagues around the world. You will learn, contribute, and grow with us\n\n LIFE AT EPAM\n \n EPAM is a leading global provider of digital platform engineering and development services. EPAM has been named the top IT Services company on the Fortune “100 Fastest-Growing Companies” list\n Established in 2019, EPAM Vietnam has more than 150 employees and is still expanding rapidly. We offer a multicultural environment where our tech talents can proactively develop world-class solutions directly with international clients\n We adopt a global growth strategy, thinking and acting like start-ups, working in multi-disciplinary teams, and delivering results. You’ll find interesting challenges typically dealt with at a start-up, yet you’ll be in a highly professional corporate setting\n\n HOW WE HIRE\n \n Apply and tell us about yourself\n Go through some standard interviews\n\n General interview with a recruiter\n Technical interview with our technology experts\n Manager interview or Offer interview with a hiring manager\n\n Get ready to join the team\n Not sure if you meet all the requirements? No problem. Let's talk anyway and find out more!\n It takes 1 min of application to start the journey with us. Apply now!\n\n",
        "jd_num_tokens": 533
    },
    "Intern (Technical-Engineering) @ Synopsys": {
        "id": 16,
        "title": "Intern (Technical-Engineering)",
        "company": "Synopsys",
        "jd_text": "\n\n    49904BR\n   \n\n    VIETNAM - Ho Chi Minh \n   \n\nJob Description and Requirements\n\nOur Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. And we design the next-generation processes and models needed to manufacture those chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules.  At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.  Internship Overview: CAD team - Synopsys Viet Nam is welcoming passionate-and-talented senior students to join and experience the professional working environment as well as get to know more about IC design.  If you are a good learner and passionate about IC design, we want to meet you. Opportunities:\n\n Have chances to be trained by experts in CAD team to work with multi-functional teams in IC designs\n Be trained to design, develop, troubleshoot or debug EDA tools and flows for the development of integrated circuits\n Have chances to join real projects to learn and support a global design team, debug Flow and Design issues, interface with foundries, configure the IP Project environment and design flows.\n Assist in developing routines and utility programs to aid in the design of Integrated Circuits.\n\n Requirements:\n\n Final year students major in Electronics Engineering, Telecommunications, Electromechanics, Computer Science or other related majors.\n Proficiency with at least one programming language/scripting language: Python, Shell, TCL,...\n Proficiency with scripting languages to automate processes.\n Good knowledge of hardware integrated circuits\n UNIX/Linux user knowledge\n Knowledge of VLSI domain like familiarity with DRC/LVS Extraction/Simulation/Reliability Analysis is a plus\n Cadence, Custom Designer EDA tool usage is a plus\n Good English communication skills\n Desires to learn and explore new technologies\n Demonstrate good investigation and problem-solving skills\n\n Inclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\n\nJob Category\n\n    Interns/Temp \n   \n\nCountry\n\n    Viet Nam \n   \n\nJob Subcategory\n\n    Intern (Technical-Engineering) \n   \n\nHire Type\n\n    Intern\n   \n\n",
        "jd_num_tokens": 390
    },
    "AI Video Enhancement Algorithm Engineer @ CÔNG NGHỆ PUWELL CLOUD": {
        "id": 17,
        "title": "AI Video Enhancement Algorithm Engineer",
        "company": "CÔNG NGHỆ PUWELL CLOUD",
        "jd_text": "Giới thiệu:\n At Puwell Cloud Tech, a cutting-edge technology innovator, we specialize in leveraging artificial intelligence to enhance and improve the quality of video content. We are in search of a talented and passionate AI Video Enhancement Algorithm Engineer to join our team. Together, we aim to develop next-generation video enhancement solutions, offering unparalleled visual experiences to our users. \nChi tiết công việc \nDevelop and optimize AI algorithms related to video enhancement, such as image sharpening, noise reduction, and dynamic range expansion. \nImprove existing algorithms to enhance the efficiency and quality of video processing. \nAnalyze and process video data, effectively translating research findings into applications. \nWork closely with the team to ensure successful implementation and integration of algorithms. \nStay updated with the latest advancements in AI and computer vision technologies, driving innovation. \nYêu cầu ứng viên \nMaster’s or Ph.D. in Computer Science, Artificial Intelligence, Computer Vision, or a related field. \nDeep understanding of video enhancement technologies, familiar with relevant machine learning and deep learning algorithms. \nProficiency in programming languages like Python, C++, with solid coding skills. \nExcellent data analysis and problem-solving abilities. \nStrong teamwork and communication skills, with a spirit of innovation. \nQuyền lợi \nSalary: 1,200 USD - 2,500 USD \nA cutting-edge work opportunity in the field of video AI enhancement. \nCompetitive salary and benefits. \nBroad personal growth and professional development opportunities. \nAn innovative and supportive work environment. \nA culture that values work-life balance. \nĐịa điểm làm việc \n\nHồ Chí Minh: Toà nhà Paragon, 3 Nguyễn Lương Bằng, P. Tân Phú, Q. 7, Quận 7\n Địa điểm làm việc: TPHCM \nLương: 30000K - 50000K VND một tháng \nLoại hình công việc: Thỏa thuận thời gian \nYêu cầu: Chứng Minh Nhân Dân (CMND), Cover Letter \nQuyền lợi: Chế độ bảo hiểm, Cơ Hội Phát Triển, Hỗ trợ Laptop, Nghỉ Phép Năm, Nghỉ thứ 7chủ nhật \nHạn nộp: 2024-06-18 \nKinh nghiệm: Không yêu cầu kinh nghiệm làm việc \nBằng cấp: Trên đại học \nLĩnh vực: IT/CNTT -IT Phần mềm \nSố lượng cần tuyển: 1 \nGiới tính: Không yêu cầu",
        "jd_num_tokens": 337
    },
    "Scrum Master @ GFT Technologies SE": {
        "id": 18,
        "title": "Scrum Master",
        "company": "GFT Technologies SE",
        "jd_text": "\nWhat do we do?\nAs a pioneer for digital transformation GFT develops sustainable solutions across new technologies – from cloud engineering and artificial intelligence to blockchain/DLT. With its deep technological expertise, strong partnerships, and comprehensive market know-how GFT offers advice to the financial and insurance sectors, as well as in the manufacturing industry. Through the intelligent use of IT solutions GFT increases productivity and creates added value for clients. Companies gain easy and safe access to scalable IT-applications and innovative business models.\n\nWho are we?\nHaving started in Germany in 1987, GFT Technologies has grown to become a trusted Software Engineering and Consulting specialist for the international financial industry, counting many of the world’s largest and best-known Banks as our clients. We are an organization that empowers you to not only explore but raise your potential and seek out opportunities that add value. At GFT, diversity, equality, and inclusion are at the core of who we are. Ensuring a diverse and inclusive working environment for all communities is one of the main pillars of our diversity strategy, based on our core values and culture. We have been certified for 2022/23 as a ‘Great place to work’ in the APAC region. So, if you want to have the opportunity to work with an outstanding and progressive organization this position could be right for you.\n\nRole responsibilities\n\nBe the Scrum Master (SCRUM/LeSS) for the team, leading the activities of grooming and maintaining the product backlog\nPossess strong problem solving, analytical skills with an ability to handle multiple tasks & prioritize accordingly\nRisk management skills\nContribute to backlog management, prioritization within the team\nPrepare user stories agree with team and Product Owner\nContribute towards release planning and release signoffs\nAdhere to organizational guidelines and process\nTechnical background is nice to have, good knowledge of Banking is an advantage\nFacilitating discussion, decision making, and conflict resolution when discussing issues across squads\nDemonstrated ability to effectively communicate, troubleshoot, and problem\nStrong interpersonal & negotiation skills in dealing with multiple stakeholders\nMust be flexible, adaptable, and have the ability to work in a fast-paced changing environment\nAnalytical and conceptual thinking skills\nExcellent documentation skills\n\n Your Skills and Experience\n\nA bachelor’s degree in Computer Science or related. PMP or an equivalent Agile (SCRUM, LeSS) certification would be considered an asset\nAt least 5 years’ experience in a Project Manager role, good banking knowledge is an advantage\nPossess excellent verbal and written communication skills\nFamiliar with MS Project, JIRA/Confluence for dashboards, boards configuration, burndown, and similar tools\nApplicable knowledge of the technologies used by the team\nGood skills and knowledge of servant leadership, facilitation, situational awareness, conflict resolution, continual improvement, empowerment, and increasing transparency\nKnowledge of various well-documented patterns and techniques for project management\nA proven record of leading and supporting successful projects\nPrevious experience in a leadership role with strong and proven leadership skills\nConflict resolution and conflict management experience\nHighly organized and excellent time management ability\nAble to multitask with a strong understanding of core manager duties\nExcellent communication skills and interpersonal abilities, including negotiation skills\n\n \nWhat can we offer you?\n\nCompetitive salary\n13th-month salary guarantee\nPerformance bonus\nProfessional English course for employees\nPremium health insurance\nExtensive annual leave\n\nAbout Us\n We show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nWhy Choose GFT?\n\nCompetitive Compensation\nBenefits package including comprehensive medical, dental, vision and others\nCompany Culture based on our Core Values\nProfessional Development Training with Individual Development Plans to map out your career growth\nOpportunity to work in a global environment with diverse teams built with colleagues from around the world\nOpportunity to work with technology industry leaders in the financial services industry\nOpportunity to work for big name clients in capital markets, banking and other industries\n\n",
        "jd_num_tokens": 701
    },
    "Senior Manager, Digital Innovation and Library Systems @ RMIT University": {
        "id": 19,
        "title": "Senior Manager, Digital Innovation and Library Systems",
        "company": "RMIT University",
        "jd_text": "\n\n  Overview:\n \n\n   RMIT University Commitment\n \n\n   RMIT is committed to the rights of students and staff to be safe, respected, valued, and treated as an equal in their place of study and work. All staff are expected to share this commitment and contribute to a safer community. While carrying out their role, staff are in a position of trust with students. Staff have a duty of care to report wellbeing concerns about students through the designated channels and uphold to the code of conduct. RMIT Vietnam expects all staff members to comply with its Code of Conduct, policies and procedures, which relate to legal and regulatory requirements and our ways of working.\n \n\n   Why RMIT University Vietnam?\n \n\n   RMIT Vietnam is committed to excellence, innovation, and social responsibility. We welcome applications from qualified and passionate individuals who share our values and vision. RMIT University has a global reputation and ranks 140th globally and 11th in Australia in QS World University Rankings 2024. To learn more about our rankings, please check out our latest facts and figures here \n  \n   Reputation and rankings - RMIT University\n  \n\n   RMIT Vietnam has been honoured with the respectable HR Asia Award as Top Employer To Work For in Asia. To find out more about RMIT Vietnam and our current vacancies, please visit our website: \n  \n   https://www.rmit.edu.vn/careers\n  \n\n   Position Summary\n \n\n   The Digital Innovation and Library Systems Specialist plays a pivotal role in managing and integrating digital innovations such as artificial intelligence (AI) tools as well as being is a vital member of the Global Library Technology & Support Team. This position will impact the reputation of the RMIT library across campuses around the world. A successful candidate will ensure that new and innovative technologies including (but not limited to) AI are not only supported but also purposefully aligned to deliver a seamless experience for library users across the system. Additionally, the position will provide expert advice and guidance on integrating two ExLibris Library Management Systems (one in Melbourne and one in Vietnam) with other enterprise systems and support staff development and training needs related to these systems for users in Vietnam and other locations as needed. The focus will be on driving innovative digital service initiatives, including library-focused AI tools, and ensuring their successful development and support. This position reports directly to the Associate Director, Library Services—Vietnam, and will have a dotted-line relationship with a counterpart in Melbourne.\n \n\n Reporting Line:\n \n\n   Reports to: Associate Director, Library and Digital Services-Vietnam\n \n\n   Indirectly reports to: Dotted-line to the Manager, Digital Innovation Discovery & Library Systems in Melbourne\n \n\n   KEY ACCOUNTABILITY\n \n\n   1. Digital Innovation Leadership:\n \n\n Spearhead the provision of digital and innovative technologies such as AI with a focus on digital collections, and services.\n Collaborate extensively with a wide range of Library and University stakeholders to drive innovation that lead to seamless integration of library services across the university.\n Stay informed about emerging AI and other technologies and trends with a library-focus to ensure the library remains relevant and aligned with the University’s goals.\n\n   2. Team Capability Building:\n \n\n Develop and enhance the capabilities of the global library technology team as well as library teams in Vietnam.\n Support the maintenance of library discovery technologies and overall systems.\n Drive the development of new digital initiatives with an AI focus.\n Implement best practice solutions to achieve strategic objectives in an innovative, collaborative, and agile environment.\n\n   3. Strategic Landscape Assessment:\n \n\n Take a strategic view of the external landscape related to library systems, discovery platforms, emerging technologies, and metadata.\n Ensure alignment with the library’s mission and the University’s overall vision.\n\n   4. Stakeholder Collaboration:\n \n\n Collaborate effectively with internal and external stakeholders on a local, regional, and international level via direct communication with universities, vendors, library associations, and technology leaders at levels.\n Deliver excellent outcomes for library users through cooperative efforts with all stakeholders.\n Build strong relationships to foster successful partnerships across sectors—including education and the library industry.\n Work with cross-functional teams to enhance overall library services utilizing the latest AI (and other) tools with a library-focus.\n\n   5. Project Management Excellence:\n \n\n Demonstrate strong project management skills, ensuring successful and timely delivery of outcomes.\n Coordinate, oversee, and take responsibility for an integrated approach to merging the Exlibris library management systems and its components between RMIT locations.\n Ensure effective services and buy-in from users through well-executed projects and training sessions.\n\n   For a more detailed description of the key areas of responsibility for this position please click \n  \n   here\n  \n\nto download the JD.\n \n\n   KEY SELECTION CRITERIA\n \n\n Master’s degree in Library Science, Information Technology, or a related field. Proven experience in project management dealing with merging two library systems (ExLibris systems experience preferred), with successful and timely outcomes.\n Strong analytical skills and the ability to assess and adapt to changing technological landscapes that incorporate AI tools—preferably within a library environment.\n Proven record of a commitment to continual improvement and strong problem-solving skills.\n Passion for digital innovation and enhancing library services maximizing library systems and AI tools.\n Strong IT support skills and familiarity with library systems, ExLibris experience preferred.\n Demonstrated ability to influence strategic thinking, foster innovation, and effectively manage workplace changes due to new AI-based innovations and tools.\n Relationship-building skills and stakeholder management experience.\n Ability to display appropriate behaviours in line with the position and RMIT Values.\n\n   Benefits\n \n\n Competitive remuneration package in USD (for expatriate candidates) or VND (for Vietnamese candidates).\n Relocation allowance package up to USD $6,000 with support to relocate overseas candidate (and family) from home location to Vietnam for expatriates applying outside Vietnam.\n One-way flight from home location to Vietnam for staff and immediate dependents.\n School tuition fees for children, up to USD $20,000 per child up to 2 children per year\n Private premium medical insurance for employee and immediate family\n 20 days annual leave plus 5 days paid leave Christmas closure and paid sick leave.\n Support and guidance from experienced Mobility Advisor to assist in work permit and visa application together with relocation to and settling into living and working in Vietnam.\n Ongoing professional development program and support.\n\n   Further information\n \n\n   The role located is Ho Chi Minh city Vietnam, is open for both local and expatriate candidates.\n \n\n   Work Permit\n \n\n   All foreign employees must adhere to the requirements for obtaining a valid visa and work permit in Vietnam. These requirements are mandated by the Government and may be over and above the mandatory requirements and key selection criteria. Work permit requirements are subject to change. RMIT Vietnam accepts zero tolerance to non-adherence of the immigration laws of Vietnam.\n \n\n   English Proficiency\n \n\n   English is the language of teaching and communication at RMIT Vietnam. For this role, the minimum requirement is IELTS 7.0 (General) with a score of at least 6.0 or 170 in Lingua Skills.\n \n\n   To Apply\n \n\n   In order to be considered for this role, it is mandatory to submit both a resume AND A COVER LETTER. Please click on the 'Apply' link provided below to initiate the application process. Your application will not be considered complete without the submission of both documents.\n \n\n Please note, we will be running a rolling recruitment process, so please do not wait until the closing date to apply.\n\n   Applications Close:\n  25 thg 6 2024 11.59 pm\n \n\n   RMIT University Vietnam (RMIT Vietnam) is a campus of RMIT University. RMIT Vietnam is creating an innovative research, teaching and learning culture. We are committed to providing internationally recognised high-quality education and professional training for our students, clients and members of the community. As an internationally recognised Australian university based in Asia, RMIT Vietnam is assisting in the development of human resources capability in Vietnam and the region.\n \n\n    https://www.rmit.edu.vn/about-us\n  \n\n",
        "jd_num_tokens": 1250
    },
    "Senior Data Engineer @ GFT Technologies SE": {
        "id": 20,
        "title": "Senior Data Engineer",
        "company": "GFT Technologies SE",
        "jd_text": "\nWhat do we do?\nAs a pioneer for digital transformation GFT develops sustainable solutions across new technologies – from cloud engineering and artificial intelligence to blockchain/DLT. With its deep technological expertise, strong partnerships, and comprehensive market know-how GFT offers advice to the financial and insurance sectors, as well as in the manufacturing industry. Through the intelligent use of IT solutions GFT increases productivity and creates added value for clients. Companies gain easy and safe access to scalable IT-applications and innovative business models.\n\nWho are we?\nHaving started in Germany in 1987, GFT Technologies has grown to become a trusted Software Engineering and Consulting specialist for the international financial industry, counting many of the world’s largest and best-known Banks as our clients. We are an organization that empowers you to not only explore but raise your potential and seek out opportunities that add value. At GFT, diversity, equality, and inclusion are at the core of who we are. Ensuring a diverse and inclusive working environment for all communities is one of the main pillars of our diversity strategy, based on our core values and culture. We have been certified for 2022/23 as a ‘Great place to work’ in the APAC region. So, if you want to have the opportunity to work with an outstanding and progressive organization this position could be right for you.\n\nRole Summary: We are seeking a highly motivated Senior Data Engineer with minimum of 8 years of experience to join our dynamic data engineering team. As a Senior Data Engineer at GFT, you will play a pivotal role in designing, maintaining, and enhancing various analytical and operational services and infrastructure crucial for the organization's functions. You'll collaborate closely with cross-functional teams to ensure the seamless flow of data for critical decision-making processes.\n\n Key Activities:\n\nData Infrastructure Design and Maintenance: Architect, maintain, and enhance analytical and operational services and infrastructure, including data lakes, databases, data pipelines, and metadata repositories, to ensure accurate and timely delivery of actionable insights.\nCollaboration: Work closely with data science teams to design and implement data schemas and models, integrate new data sources with product teams, and collaborate with other data engineers to implement cutting-edge technologies in the data space.\nData Processing: Develop and optimize large-scale batch and real-time data processing systems to support the organization's growth and improvement initiatives.\nWorkflow Management: Utilize workflow scheduling and monitoring tools like Apache Airflow and AWS Batch to ensure efficient data processing and management.\nQuality Assurance: Implement robust testing strategies to ensure the reliability and usability of data processing systems.\nContinuous Improvement: Stay abreast of emerging technologies and best practices in data engineering, and propose and implement optimizations to enhance development efficiency.\n\n \nRequired Skills:\n\nTechnical Expertise: Proficient in Unix environments, distributed and cloud computing, Python frameworks (e.g., pandas, pyspark), version control systems (e.g., git), and workflow scheduling tools (e.g., Apache Airflow).\nDatabase Proficiency: Experience with columnar and big data databases like Athena, Redshift, Vertica, and Hive/Hadoop.\nCloud Services: Familiarity with AWS or other cloud services like Glue, EMR, EC2, S3, Lambda, etc.\nContainerization: Experience with container management and orchestration tools like Docker, ECS, and Kubernetes.\nCI/CD: Knowledge of CI/CD tools such as Jenkins, CircleCI, or AWS CodePipeline.\n\n \nNice-to-have requirements:\n\nProgramming Languages: Familiarity with JVM languages like Java or Scala.\nDatabase Technologies: Experience with RDBMS (e.g., MySQL, PostgreSQL) and NoSQL databases (e.g., DynamoDB, Redis).\nBI Tools: Exposure to enterprise BI tools like Tableau, Looker, or PowerBI.\nData Science Environments: Understanding of data science environments like AWS Sagemaker or Databricks.\nMonitoring and Logging: Knowledge of log ingestion and monitoring tools like ELK stack or Datadog.\nData Privacy and Security: Understanding of data privacy and security tools and concepts.\nMessaging Systems: Familiarity with distributed messaging and event streaming systems like Kafka or RabbitMQ.\n\n \nWhat can we offer you?\n\nCompetitive salary\n13th-month salary guarantee\nPerformance bonus\nProfessional English course for employees\nPremium health insurance\nExtensive annual leave\n\nAbout Us\n We show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nWhy Choose GFT?\n\nCompetitive Compensation\nBenefits package including comprehensive medical, dental, vision and others\nCompany Culture based on our Core Values\nProfessional Development Training with Individual Development Plans to map out your career growth\nOpportunity to work in a global environment with diverse teams built with colleagues from around the world\nOpportunity to work with technology industry leaders in the financial services industry\nOpportunity to work for big name clients in capital markets, banking and other industries\n\n",
        "jd_num_tokens": 814
    },
    "Startup Account Manager, Vietnam @ Amazon Web Services Vietnam Company Limited": {
        "id": 21,
        "title": "Startup Account Manager, Vietnam",
        "company": "Amazon Web Services Vietnam Company Limited",
        "jd_text": "\nBA/BS degree required.\nA technical background in engineering, computer science, or MIS a plus.\n10 years of experience in IT sales.\n Would you like to be part of a team focused on building adoption of Amazon Web Services (AWS) within Startups in Vietnam? Do you have the business savvy and the technical acumen necessary to help establish Amazon Web Services as the premier cloud provider? \n\n We are looking for a talented individual who would like to be part of an organisation driving hyper-growth and helping startups operate on AWS and innovate on our platform. Do you have the business savvy to lead a cross-functional team that includes specialists, solution architects, and product and partner teams to deliver business growth for AWS and our startup customers? AWS is seeking an experienced Account Manager for Strategic Startup Sales to lead and expand the business with our hottest Vietnamese Startups. \n\n The right candidate will possess a technology sales management background and experienced with engagements at the CXO level. He/she should also be able to effectively engage AWS’ most senior product leaders and executive team to define and deliver creative proposals and influence roadmap decisions for both AWS and our ISV partners. Lastly, you must be a self-starter who is prepared to own, define, develop and execute a geographic plan and to consistently deliver on quarterly wins targets. \n\n Key job responsibilities \nAs an Account Manager with Amazon Web Services (AWS) focused on startup ecosystem, you will have the exciting opportunity to build AWS’ startup business and contribute to the future of Vietnam’s startup ecosystem. Your responsibilities will include increasing awareness, adoption, and market expansion across Vietnam. \n\n The ideal candidate will possess both a business development and technical background that enables him or her to drive an engagement with startup founders, startup CXOs, IT architects as well as other startup ecosystem players such as channel partners and VC partners. He/she should also be a self-starter who is prepared to develop and execute against a territory coverage and growth plan. \n\n This opportunity will be based in Ho Chi Minh City/Hanoi \n\n Key job responsibilities \n\nBuild AWS' startup business in Vietnam and increase adoption of AWS services.\nDevelop and execute against a comprehensive sales plan.\nCreate & articulate compelling value propositions around AWS services.\nWork with partners to extend reach & drive adoption.\nPossess the technical ability to explain (not implement) Cloud Computing, infrastructure solutions (Server, Storage, DC Services), Artificial Intelligence Services & Internet architectures (firewalls, load balancers, etc).\nDevelop long-term strategic relationships with key accounts.\nEnsure customer satisfaction.\nExpect moderate travel.\n About the team \nDiverse Experiences \nAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \nWhy AWS? \nAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \n\n Inclusive Team Culture \nHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness. \n\n Mentorship & Career Growth \nWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. \n\n Work/Life Balance \nWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \n\n We are open to hiring candidates to work out of one of the following locations: \n\n Hanoi, VNM | Ho Chi Minh City, VNM \n\nDirect sales experience with Vietnam based customers.\nExisting network in the Vietnam Startup community is a plus.\nWould have consistently exceeded key performance metrics.\nDemonstrated ability to engage and influence C-level executives.\nStrong presentation skills and the ability to articulate complex concepts to cross-functional audiences.\nStrong technical competencies in the areas of cloud computing, SOA, web services and enterprise software.\nStrong verbal and written communications skills are a must, as well as the ability to work effectively across internal and external organizations.\n",
        "jd_num_tokens": 779
    },
    "CRM Data and Analytics Manager @ HSBC": {
        "id": 22,
        "title": "CRM Data and Analytics Manager",
        "company": "HSBC",
        "jd_text": "\n\n          Job Advert Details \n         \n\n            Some Careers Grow Faster Than Others.\n           \n\n If you’re looking for a career that will help you to stand out, join HSBC and fulfil your potential. Whether you want a career that could take you to the top, or simply take you in an exciting new direction, HSBC offers opportunities, support and rewards that will take you further.\n            \n Wealth and Personal Banking (WPB) is our new global business combining Retail Banking and Wealth Management; and Global Private Banking, to become one of the world’s largest global wealth managers with USD1.4 trillion in assets. Our dedicated colleagues serve millions of customers worldwide across the entire spectrum of private wealth, ranging from personal banking for individuals and families, through to business owners, investors and ultra-high-net-worth individuals. We provide products and services such as bank accounts, credit cards, personal loans and mortgages, as well as asset management, insurance, wealth management and private banking, that best suit our customers’ needs.\n            \n We are currently seeking a high calibre professional to join our team as an CRM Data and Analytics Manager\n           \n\n Role Purpose\n\n              The role reports to SVP, Head of Data & Analytics for WPB. The role responsible for managing and implementing WPB’s CRM and Analytics initiatives, both for Local & Regional team. The CRM & Analytics strategy seeks to build long term, ethical client relationships and high quality analytical output; with the goal of deriving long term values from each individual customers.\n            \n\n The role is responsible for the preparation and execution of all customer information and provision of analytical support for customer initiatives (e.g. campaigns) and to support all WPB activities in areas of Proposition and Product Management. The individual is also expected to collaborate with other team members to identify key trends that arise from the analysis of customer data and work with other areas in CVM to ensure they are planned into BAU activity where appropriate.\n            \n\n The role is required to collaboration with MKT and the various business partners (eg. Sales & Distribution, CCR, IT, Products & Planning, OPS, etc). It covers the full loop of strategizing, planning & development, executing, evaluating and enhancing tools, programmers and initiatives.\n            \n\n Principal Accountabilities\n\n Impact on the Business\n\n Plan and implement all CRM projects with the Regional and/or relevant business units so as to deliver a highly efficient CRM & Analytics platform to increase profitability and sales number for all different products and sales forces.\n Ensure that the approach is collective and comprehensive, considering people, processes, culture and systems\n Assist SVP Head of Data & Analytics to utilize customer data to actively prepare product treatments to optimise value for both customer and Bank in line with our customer propositions\n Collaborate with other team members to integrate and enhance D&A usage as part of customer management and sales process, including processes and system improvements\n Support SVP Head of Data & Analytics to run initiatives/campaigns across all sales channels, including self-service, online channel, lead-bank program…\n Support SVP Head of Data & Analytics to Standardize all D&A core process/workflow. Maintain regular data cleaning and data integrity programs to ensure that WPB database continues to have high data integrity.\n Works on assigned regional/local projects.\n Monitoring & suggesting solution to improve WPB customer database integrity when required\n\n Customers / Stakeholders\n\n Deliver support to sales channels to create/ maintain/expand customer relationships\n Support SVP Head of Data & Analytics to provide advice to end users to optimize the use of CRM-system platform to drive and deliver sales growth, includes the use of artificial intelligence of CRMS (eg: IS /KET) to build and generate business leads to the respective sales streams.\n Support SVP Head of Data & Analytics to provide system training & refresh training for business users if required.\n Treat customer fairly with integrity.\n\n Leadership & Teamwork\n\n To support V SVP Head of Data & Analytics in providing a high quality, customer driven, support function\n Proactive work on assigned initiatives while ensuring timely implementation \n Operational Effectiveness & Control\n\n Assist SVP Head of Data & Analytics to determine the need and monitor our competitive position in complaints within assigned customer segment through market research, data warehouse analysis, complaints data and feedback from other business units and line managers. Support SVP to execute the analysis and use information gathered to develop strategies to optimize the customer experience.\n Collaborate with the team to build up an effective team through communication, knowledge sharing, and development plans. Join up to cultivate an environment that supports diversity and reflects the HSBC brand.\n Review & improve the process for providing leads sales teams in a timely manner\n In some projects / assigned areas, act as main contact point for ASP on CRM & Analytics related matters\n Comply with internal control/Compliance policies\n Be responsible an adequate understanding of all relevant regulations applicable to the business and generally assisting with resolution of compliance related issues.\n Complete tasks and fulfill responsibilities as outlined in CDD LoBP, AML Policy; Sanctions Policy and always stay vigilant to identify and report warning signs to detect, deter and protect customers and the bank from fraud and financial crimes.\n\n          Qualifications \n         \n\nKnowledge / Experience \n\n2-5 years of related experience.\n Experience in banking, finance or related industry\n Knowledge and skill of CRM and Analytics\n Good at SQL and Python\n Good time management, good communication skill\n Able to meet tight deadlines and multitask\n Excellent analytical capabilities\n Exhibit strong interpersonal skills.\n Must be independent worker as well as a good team player.\n\n You’ll achieve more when you join HSBC.\n http://www.hsbc.com/careers\n HSBC is committed to building a culture where all employees are valued, respected and opinions count. We take pride in providing a workplace that fosters continuous professional development, flexible working and opportunities to grow within an inclusive and diverse environment. Personal data held by the Bank relating to employment applications will be used in accordance with our Privacy Statement, which is available on our website.\n Issued by The Hongkong and Shanghai Banking Corporation Limited\n\n",
        "jd_num_tokens": 983
    },
    "Senior/Staff Design Verification Engineer @ Synopsys": {
        "id": 23,
        "title": "Senior/Staff Design Verification Engineer",
        "company": "Synopsys",
        "jd_text": "\n\n    48270BR\n   \n\n    VIETNAM - Ho Chi Minh \n   \n\nJob Description and Requirements\n\n    Synopsys Solution Group is expanding our sub-system R&D team in Ho Chi Minh city, Vietnam. We’re seeking a highly motivated design verification engineer to join our growing highspeed interface sub-system R&D team. \n    \n Does this sound like a good role for you?\n    \n In this role, you will be responsible for: \n    \nDefining verification plans and build verification environments for block/sub-system level designs using System Verilog with UVM.\n Applying advanced verification techniques like constrained random generation, functional coverage, assertions, and formal verification.\n Write test cases, checkers, and coverage that implement the verification test plan.\n Work closely with RTL designers and other parts of our global verification team to debug failures.\n\n  Key Qualifications:\n\n Bachelor or Master degree in EE or CS, with 7 years’ experience in digital verification experience in the industry. \nExperience of verification of interfaces and controllers of one or more high-speed interface protocols such as PCI-Express, CXL, UCIe, HBM, DDR.\n Knowledge of industry-standard simulators, revision control systems, and regression systems.\n Experience of RTL verification using coverage driven verification techniques.\n Programming skill in C/Perl/Python.\n Proficient in HDL languages System Verilog, Verilog, or VHDL\n Good analytical, oral, and written communication skills.\n Self-motivated, proactive team player.\n\n At Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you.\n    \n Our Silicon IP business is all about integrating more capabilities into an SoC—faster. We offer the world’s broadest portfolio of silicon IP—predesigned blocks of logic, memory, interfaces, analog, security, and embedded processors. All to help customers integrate more capabilities. Meet unique performance, power, and size requirements of their target applications. And get differentiated products to market quickly with reduced risk.\n    \n Inclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\n\nJob Category\n\n    Engineering \n   \n\nCountry\n\n    Viet Nam \n   \n\nJob Subcategory\n\n    SOC Engineering \n   \n\nHire Type\n\n    Employee\n   \n\n",
        "jd_num_tokens": 374
    },
    "Principal Design Verification Engineer @ Synopsys": {
        "id": 24,
        "title": "Principal Design Verification Engineer",
        "company": "Synopsys",
        "jd_text": "\n\n    48345BR\n   \n\n    VIETNAM - Ho Chi Minh \n   \n\nJob Description and Requirements\n\nPrincipal Design Verification Engineer.\n\n About the Opportunity:\n We are Synopsys Solution Group, and we are proud to be at the heart of the innovations that impact the world and change the way people live. Everything you need to enable innovation from Silicon to Software is what we make at Synopsys. This opportunity offers much more than just an engineering job, this is from Synopsys Solution Group - the top IP provider in the world, where the best IPs with the broadest portfolio and the most advanced technology are created. \n     If you’re ready to excel, innovate, and pursue a passion in ASIC Design Verification for IP, Subsystem or SoC, we’d like to welcome you to our newly created Subsystem Verification Team in Ho Chi Minh city, Vietnam. We are looking for Design Verification talents of various levels: Design Verification Engineers, Leads and Managers. With your expertise, together with the industry most talented professionals in the team, empowered by Synopsys EDA ecosystem, you are fueling the new era of Smart Everything by offering high-speed silicon-proven interface IP solutions in the latest process technology for the most cutting-edge industry vertical including Artificial intelligence, Autonomous Vehicles, High-Performance Compute, Cloud, 5G Mobile and the IoT etc. IPs and subsystems you make will be integrated into tens of millions of SoCs that are used by billions of people.\n     You will be joining a true global team that has personality, enthusiasm and a fun culture with diversity. You will have all the support you need to grow and develop with us. No matter where you are in your career, the experience and expertise you grow here will put you miles ahead in the career advancement and open the path to all possibilities.\n    \n Responsibilities:\n\n Define verification plans and build verification environments for block/sub-system level designs using Verilog, System Verilog and UVM.\n Write test cases, checkers, and coverage that implement the verification test plan.\n Apply advanced verification techniques like constrained random generation, functional coverage, assertions, and formal verification.\n Work closely with RTL designers and other parts of our global verification team to debug failures.\n Qualifications:\n\n Bachelor or Master degree in EE or CS.\n 10+ years of experience in design verification in the industry.\n Knowledge of one or more protocols such as AMBA, PCI-Express, CXL, UCIe, Ethernet, HBM, DDR…\n Knowledge of industry-standard simulators, revision control systems, and regression systems.\n Experience of RTL verification using coverage driven verification techniques\n Experience in developing System Verilog, UVM or similar HDL based test environments.\n Programming skills such as HDL, Verilog, System Verilog, C, Perl, Python.\n Good analytical, oral, and written communication skills.\n Self-motivated, proactive team player.\n Inclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\n\nJob Category\n\n    Engineering \n   \n\nCountry\n\n    Viet Nam \n   \n\nJob Subcategory\n\n    SOC Engineering \n   \n\nHire Type\n\n    Employee\n   \n\n",
        "jd_num_tokens": 487
    },
    "Country Human Resources Manager @ GFT Technologies SE": {
        "id": 25,
        "title": "Country Human Resources Manager",
        "company": "GFT Technologies SE",
        "jd_text": "\nWhat do we do?\nAs a pioneer for digital transformation, GFT develops sustainable solutions across new technologies – from cloud engineering and artificial intelligence to blockchain/DLT. With its deep technological expertise, strong partnerships, and comprehensive market know-how GFT offers advice to the financial and insurance sectors, as well as in the manufacturing industry. Through the intelligent use of IT solutions GFT increases productivity and creates added value for clients. Companies gain easy and safe access to scalable IT-applications and innovative business models\n\nWho are we?\nHaving started in Germany in 1987, GFT Technologies has grown to become a trusted Software Engineering and Consulting specialist for the international financial industry, counting many of the world’s largest and best-known Banks as our clients. We are an organization that empowers you to not only explore but raise your potential and seek out opportunities that add value. At GFT, diversity, equality, and inclusion are at the core of who we are. Ensuring a diverse and inclusive working environment for all communities is one of the main pillars of our diversity strategy, based on our core values and culture. We have been certified for 2022/23 as a ‘Great place to work’ in the APAC region. So, if you want to have the opportunity to work with an outstanding and progressive organization this position could be right for you.\n\nThe Country Human Resources Manager - Vietnam is responsible for leading and managing the HR function for Vietnam. This role involves developing and implementing HR strategies and initiatives aligned with the overall business strategy, managing the HR team, ensuring compliance with local labor laws, and fostering a positive workplace culture. The HR Manager will work closely with senior leadership to support organizational goals, enhance employee engagement, and drive performance.\n\nRole Responsibilities\n1. HR Strategy and Planning:\n\nDevelop and implement HR strategies and initiatives aligned with the overall business objectives\nProvide strategic HR support to senior management on workforce planning, talent management, and organizational development.\n\n2. Employee Relations:\n\nFoster a positive and inclusive workplace culture\nAddress employee concerns and grievances promptly and effectively\nEnsure effective communication between management and employees.\n\n3. Compensation and Benefits:\n\nDevelop and manage competitive compensation and benefits programs\nEnsure compliance with local labor laws and regulations regarding compensation and benefits\nConduct regular benchmarking to ensure competitiveness in the market.\n\n4. Compliance and Reporting:\n\nEnsure compliance with local labor laws and regulations\nPrepare and maintain HR-related reports and metrics\nManage HR audits and inspections.\n\n5. HR Operations:\n\nBe responsible for HR operations, including payroll, employee records, and HRIS management\nImplement HR policies and procedures and ensure adherence across the organization.\n\n6. Leadership and Team Management:\n\nLead, mentor, and develop the HR team to achieve departmental and organizational goals\nPromote a culture of high performance and continuous improvement.\n\nRequired Education & Experience\n\nBachelor’s degree in Human Resources, Business Administration, or a related field \nMinimum of 7-10 years of HR experience with at least 3 years in a managerial role \nStrong knowledge of local labor laws and regulations \nProven experience in talent management, employee relations, and HR operations \nExcellent communication, interpersonal, and leadership skills \nAbility to work in a fast-paced environment and manage multiple priorities \nProficiency in HRIS and Microsoft Office Suite. \n\nWhat can we offer you?\n\nCompetitive salary \n13th-month salary guarantee \nPerformance bonus \nProfessional English course for employees \nPremium health insurance \nExtensive annual leave\n\nAbout Us\n We show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nWhy Choose GFT?\n\nCompetitive Compensation\nBenefits package including comprehensive medical, dental, vision and others\nCompany Culture based on our Core Values\nProfessional Development Training with Individual Development Plans to map out your career growth\nOpportunity to work in a global environment with diverse teams built with colleagues from around the world\nOpportunity to work with technology industry leaders in the financial services industry\nOpportunity to work for big name clients in capital markets, banking and other industries\n\n",
        "jd_num_tokens": 726
    },
    "product manager @ xspera": {
        "id": 26,
        "title": "product manager",
        "company": "xspera",
        "jd_text": "\n\nWorking for xspera, feels like coming home.\n\n Here at xspera we work in agile teams. You can learn, improve and prosper in your field of expertise. This is your chance to become a high achiever – working with people, who love what they do.\n If you want to live to your full potential, xspera is the place to be.\n We are seeking an ambitious and passionate Product Manager who has an affection for Microsoft enterprise technologies and collaboration stacks, but also acutely aware of the gaps they present and the endless possibilities to fill those gaps.\n If you are looking to be a “behind the scenes” technologist, this is not the place for you.\n As a Product Manager at xspera, you will lead a talented team to grow and evolve xingate 5.0 for our customers worldwide.\n Product Manager at xspera is described as\n\nA Visionary who look beyond the surface of a requirement/technology/app and see the gaps and the variations to fill it.\n\nAn Advocate for the team, the company, and the client. It is essential to find that balance in a continual pull and give environment. Become the mediator of the parties to find a solution that can be agreed by all.\nA Closer with confidence to make crucial decisions related to product and project.\n\nSound interesting? Then xspera just might be the place for you.\n Key Responsibilities\n Product Responsibilities\n\nDevelop a short and long-term xingate 5.0 product strategy and roadmap in collaboration with variety of stakeholders\nBe accountable for all stages of product lifecycle. From planning to retirement and all stages between\nResponsible for all planning, budgeting, priorities and timelines, and governance activities for xingate 5.0 activities\nEnsuring a consistent integration and user experience between different elements of the xingate 5.0 Enterprise platform\nCreate and Manage the product backlog, often working through competing priorities\n\nManage, facilitate, and create business requirements/user stories, organize and facilitate prototype reviews and UAT\nImpress on the development and designer teams the importance of consistent and robust product branding with coaching to ensure optimal and consistent UI/UX\nCollaborate closely with internal and external end users and technology teams to ensure the best possible end-user experience and continuous product improvement\nCollaborate with Technical and Solution Architects to ensure xingate 5.0 is scalable, reliable, and robust for xspera enterprise customers\nCreate training documents, user manuals, and videos and provide technical assistance in training, mentoring, and coaching professional and technical staff\n\nPlay active role in post-delivery activities with development of the product sales messaging and support related marketing activities including taking the lead in preparing and running product demos\nDevelop and execute executive level communications and messaging (including real-time management dashboards, weekly operational reports, issue analysis reports, and strategic presentations) to educate and influence key stakeholders\nRun operational cadence for the xingate 5.0 leadership team, including weekly and monthly operational meetings, bi-annual strategic planning event off-sites and ad hoc reporting and presentations.\n\nProject Responsibilities\n\nLead the estimation team into definition of perspective client requirements and establish a project effort, timeline and resource estimates\n\nCollaborate with either the client or Account Manager to retrieve all necessary project details for successful delivery\nAnticipate and mitigate project risks with the resources at hand or ability to identify what resources are required and making an appropriate request.\nBe the primary technology and business advocate to advise and direct the best practice methods in how to utilize xingate 5.0 within xspera and its international customer base\nCreate and maintain feature business requirements, User Stories, and UAT checklists\nTrain client of deliverables\n\nDelivery appropriate reports to management/client for the progress of the project\nCollaborating with the Sales, Marketing & Corporate Communications team to define the go-to-live strategy, prioritize activities, and ensure product positioning properly reflects the features and benefits of the solution to the customers\n\nCompany Responsibilities\n\nSupport recruitment and talent acquisition activities. Help to continually build the fantastic team at xspera with helping new members become acquainted with xspera community.\nContinually coach the development team into the concept of Scrum methodology and the essence of a shippable product at the end of each sprint.\n\nProvide regular internal and external communications company-wide on upcoming features products, changes and usage tips\nFacilitate communications and interactions between functional groups, team members, strategic partners and vendors\nEnsure overall xspera development program objectives are being met efficiently, and proactively look for opportunities to adjust program practices to ensure assets (people, tools, etc.) are optimized\n\nQualifications\n\nMust–Have Master’s degree in IT Technology and preferably Business Management MBA\n\nMust–Have Certification in Scrum, example PS I, PS II, PSPO I or PSPO II from scrum.org\nMust–Have Native English speaker or English certificate of TOEIC 700 or equivalent\n\nGerman and Vietnamese speaking/writing skills is a plus\n\nExperience\n\n+8 years product management experience and a track record of successful software project delivery, ideally in a corporate environment\n\n+5 years of leadership experience in an IT field\nAbility to adapt to changes, take up multiple roles based on project demands and ensure the best results\nWillingness to travel worldwide up to 50 percent of time\nDeep functional experience with the Microsoft ecosystem with hands-on experience in developing and implementing an Enterprise Platform strategy\nExcellent knowledge and expertise within Workflow and BI solutions\n\nExperience working with on-premise, cloud, and SaaS products and services\nInvolvement in leading Scrum ceremonies and activities\nOverall knowledge of ERP Systems (SAP, Oracle, MS Dynamics, etc.)\nOverall knowledge of Cloud technologies (Azure, Office 365, AWS, Google, etc.),\nOverall knowledge of the latest trends in the corporate Information Technology domain (Artificial Intelligence, Augmented Analytics, Blockchain, Data Visualization, Semantic Technologies, etc.)\n\nWhy Work at xspera\n\nAbove market salary compensation, including 13-month pay\nQuarterly and yearly performance bonus compensation\nAnnual performance reviews\n\nPersonal development, training, and creative freedom\nAbility to participate in customer projects in EU, US & Asia\nWork in a global team with highly skilled and motivated people\nSpectacular company trips\nWork location Zurich, Switzerland and/or Ho Chi Minh City, Vietnam\n\nAbout xspera\n xspera focus on the business goals of our customers. We deliver solutions which help customers achieve their business goals faster. Our enterprise portal, xingate 5.0, adapts quickly to our client’s corporate structures reducing their process costs in many areas by as much as 30% -60% through greater transparency, digitization, and process automation.\n Join xspera today and be part of the digital world of tomorrow!\n\njob overview\n\nlocation hcm, vietnam\n       \n\ncontract type full time\n       \n\nexperience\n\nsalary range contact xspera\n       \n\njob level\n\n",
        "jd_num_tokens": 1072
    },
    "Senior Java Developer @ VSL Software": {
        "id": 27,
        "title": "Senior Java Developer",
        "company": "VSL Software",
        "jd_text": "\n\nJob Title: Senior Java Developer\nJob Brief\nAs a senior Java developer, your responsibilities cover the entire software development lifecycle, from requirements gathering, analysis, design, develop new features, fix / enhance existing features for applications written in Java.\nResponsibilities\n\nEnsure the assigned tasks to be performed on-time and with high quality.\n Investigate and analyze the project requirements.\n Join and support different teams in the system design phase.\n Develop new features and fix / enhance existing features.\n Code migration from old technology stack to new technology stack.\n Participate in peer code reviews and knowledge sharing.\n Support the project estimation and creating technical documents.\n To be able to mentor junior staff.\n Weekly and / or on-demand report to manager.\n Strictly follow the project and organization processes, policies and regulations.\n\nRequirements\n\nBachelor degree in computer science or equivalent.\n At least 5 years of hands-on experience in Java, Java EE and related technologies.\n Experienced with one of the Java frameworks / platforms (Spring Framework, JHipster, Hibernate, Struts, JSF, …);\n Strong understanding of application architecture, object-oriented analysis & design (OOAD), MVC and variants, design patterns, and multi-threaded programming.\n Experienced with queuing and caching techniques such ActiveMQ, RabbitMQ, ZeroMQ, Kafka, Memcached, Redis, etc.\n Hands-on experience of CI/CD and DevOps (AWS CI/CD Pipeline, Jenkins, Docker Compose, Docker Swarm, Kubernetes, etc.) is required.\n Experienced with the RESTful API design and implement.\n Familiar with one of application development and deployment tools such as GitHub, GitLab, Jira, BitBucket, Redmine, OpenProject, Microsoft Teams Services, etc.\n Good analytical thinking and how to determine the root cause of the issue/problem.\n Proactive, well self-organized and responsible in work.\n Good teamwork spirit and flexible in work.\n Good at time management skill, communication skill, problem solving skill, and presentation skill.\n\nAs a plus\n\nHave experience working with large scale systems and enterprise systems.\n Good knowledge of software development processes/methodologies such as CMMi, Scrum, Kanban, etc.\n Having a good command of English.\n\nWhat we can offer\n\nAdditional premium healthcare plan.\n 13th month salary and performance review annually.\n Training: English, Soft and Technical skills.\n Company trip, team building activities.\n Comfortable and flexible working environment.\n\nAbout VSL\nVSL is a global software outsourcing and software consulting company which provides a wide range of services including full cycle software development, agile testing, and software consulting. Our expertise includes, but is not limited to, emerging technologies such as e-commerce, blockchain, cryptocurrency, fintech, and bots, etc.\n\nJob Features\n\n      Job Category\n     \n\n       Artificial Intelligence (AI), Back-end, Engineering, Full-stack, Java\n     \n\n",
        "jd_num_tokens": 405
    },
    "Lecturer, Information Technology (Java/Web Programming and AI/Data Science) @ RMIT University": {
        "id": 28,
        "title": "Lecturer, Information Technology (Java/Web Programming and AI/Data Science)",
        "company": "RMIT University",
        "jd_text": "\n\n  Overview:\n \n\n   RMIT University Commitment\n \n\n   RMIT is committed to the rights of students and staff to be safe, respected, valued, and treated as an equal in their place of study and work. All staff are expected to share this commitment and contribute to a safer community. While carrying out their role, staff are in a position of trust with students. Staff have a duty of care to report wellbeing concerns about students through the designated channels and uphold to the code of conduct. RMIT Vietnam expects all staff members to comply with its Code of Conduct, policies and procedures, which relate to legal and regulatory requirements and our ways of working.\n \n\n   Why RMIT University Vietnam\n \n\n   RMIT Vietnam is committed to excellence, innovation, and social responsibility. We welcome applications from qualified and passionate individuals who share our values and vision. RMIT University has a global reputation and ranks 140th globally and 11th in Australia in QS World University Rankings 2024. To learn more about our rankings, please check out our latest facts and figures here \n  \n   Reputation and rankings - RMIT University\n  \n\n   Rewards and Benefits:\n \n\n     Competitive salary package and allowances\n   \n\n     Expatriate candidates: Generous relocation allowance. Educational support up to US$20,000 per child annually, up to 2 children per family; private insurance coverage for staff and family; annual health checkup; Work Permit for staff, Visa and temporary resident cards for family members.\n   \n\n     Expert support from our Mobility Team with regards to obtaining a work permit and visas, and with relocation and settling into living and working in Vietnam.\n   \n\n     Local candidates: 13th month Tet bonus + private medical insurance (for you and your dependents) + annual health check.\n   \n\n     Generous annual leave, career leave and public holidays (Christmas and Tet Holidays)\n   \n\n     Professional development and career advancement\n   \n\n     Access to state-of-the-art facilities and resources\n   \n\n     A vibrant and diverse campus life and more!\n   \n\n   RMIT Vietnam has been honoured with the respectable HR Asia Award as Top Employer To Work For in Asia. To find out more about RMIT Vietnam and our current vacancies, please visit our website: \n  \n   https://www.rmit.edu.vn/careers\n  \n\n   Your role\n \n\n   The Lecturer is expected to contribute to the teaching and research efforts of the University, in disciplines related to their field of expertise. Specifically, the Lecturer is responsible for carrying out teaching activities within undergraduate, Masters and Graduate Diploma programs and for maintaining and advancing their scholarly, research and/or professional capabilities. The Lecturer is also expected to actively promote the program by establishing and maintaining memberships, links and partnerships with academic, industry and professional communities. The Lecturer is expected to work collaboratively and collegially with fellow academics within the teaching team, and update colleagues and students on developments in their subject area or specialisation. The Lecturer may be responsible for course coordination.\n \n\n   Reporting line\n \n\n   Reports to: Senior Program Manager, Information Technology & Software Engineering\n \n\n   Key accountabilities\n \n\n     Undertake independent teaching undergraduate level courses in the Bachelor of Information Technology program. Teaching duties include writing course materials; teaching lecture, lab, and tutorial sessions; helping students; designing, conducting, and grading assessments; implementing improvements informed by course evaluation activities and student feedback.\n   \n\n     Undertake administration duties, which may include course coordination role.\n   \n\n     Adhere to the requirements of the Academic Expectations and Development Framework of RMIT Vietnam.\n   \n\n   Key selection criteria\n \n\n   1. PhD or equivalent relevant Doctoral qualification in Computer Science, Information Technology, Software Engineering, or relevant disciplines.\n \n\n   2. Minimum 3 years of teaching experience in English-speaking universities.\n \n\n   3. Proven teaching proficiency and curriculum development in the following areas:\n \n\n     Artificial Intelligence and/or Data Science\n   \n\n     Java and/or Web (HTML/CSS/JavaScript) Programming\n   \n\n   4. Demonstrated ability to prepare and deliver programs at undergraduate level, including online delivery, and the ability to produce high quality curriculum or program materials.\n \n\n   5. Ability to undertake course coordination role.\n \n\n   6. Demonstrated capacity to work effectively with and to negotiate sensitively with students especially on issues related to effective learning.\n \n\n   7. Recent and sustained performance regarding student outcomes, student experience and feedback; combined with experience and skill in a range of teaching settings.\n \n\n   8. Recognised research profile including substantial record of research outputs in high quality journals.\n \n\n   9. Ability to operate within own discipline and cross-disciplinary/multidisciplinary teams to achieve department and University strategic outcomes.\n \n\n   10. Ability to work with external partners, industries, organisations, and communities and can operate effectively to address complex issues or seek opportunities.\n \n\n   English proficiency requirement\n \n\n   English is the language of teaching and communication at RMIT Vietnam. For this role, the minimum requirement is IELTS (Academic) with a score of at least 7.0 with no competency less than 6.5 (or equivalent, as outlined in the Recruitment, Selection and Onboarding Guidelines).\n \n\n   For Higher Education roles, English Language Proficiency may also be proven by having completed PhD studies while being instructed through the medium of English, and proof of teaching in an English-speaking environment during the previous 24 months.\n \n\n   Work permit\n \n\n   All foreign employees must adhere to the requirements for obtaining a valid visa and work permit in Vietnam. These requirements are mandated by the Government and may be over and above the mandatory requirements and key selection criteria. Work permit requirements are subject to change.\n \n\n   RMIT Vietnam accepts zero tolerance to non-adherence of the immigration laws of Vietnam.\n \n\n   How to apply\n \n\n   Click \"Apply\" to send through your CV, cover letter and any other supporting documents.\n \n\n   Applications Close:\n  26 thg 6 2024 11.59 pm\n \n\n   RMIT University Vietnam (RMIT Vietnam) is a campus of RMIT University. RMIT Vietnam is creating an innovative research, teaching and learning culture. We are committed to providing internationally recognised high-quality education and professional training for our students, clients and members of the community. As an internationally recognised Australian university based in Asia, RMIT Vietnam is assisting in the development of human resources capability in Vietnam and the region.\n \n\n    https://www.rmit.edu.vn/about-us\n  \n\n",
        "jd_num_tokens": 949
    },
    "Senior Data Analyst (SQL,Python) @ Simple Tech Investment": {
        "id": 29,
        "title": "Senior Data Analyst (SQL,Python)",
        "company": "Simple Tech Investment",
        "jd_text": "\n\nSimple Tech Investment\n\n \n\n     402 Nguyễn Thị Minh Khai, District 3, Ho Chi Minh \n    \n\n       At office\n      \n\n     Posted 7 days ago \n    \n\n     Skills: \n     SQL \nPython \nData Analyst \n\nTop 3 reasons to join us\n\nCompetitive packages Parking fee & Lunch allowance\nFlexible working hour. Annual leave 15 days/ year\nRoom to grow professionally. Sponsorship for L&D\n\nJob description\n\nIdentifying and gathering department requirements and then designing and implementing solutions that meet those needs with appropriate products or services.\nConduct in-depth data analysis using SQL, Python, and other relevant tools to extract, clean, transform, and visualize data.\nOwn the end-to-end data flow, and data analysis and provide insights into the effectiveness of the business and key performance indicators (KPIs) for the senior management team.\nCreate compelling data visualizations (e.g., dashboards, reports) to communicate insights effectively to both technical and non-technical audiences.\nPreparing reports and Providing data support for various departments for predictions using relevant data;\nMonitor partner operations and guide their action plans based on data-driven insights.\nDocument data analysis processes for future reference and knowledge sharing.\nPropose new automated data acquisition or analysis processes.\nProvide data support for various departments.\nOther tasks as assigned by management.\n\nYour skills and experience\n\nAt least 5 years of experience in the data field, with experience in tech companies being advantageous. BA degree from a university in Statistics, Business, Data Analytics, or related fields.\nStrong analytical skills with the ability to identify patterns and trends in large datasets.\nMaster in SQL, data analysis, and data visualization skills using BI tools such as Data studio and Tableau. Familiarity with R and Python is a plus.\nExcellent communication skills and the ability to work with business, product, and technical stakeholders.\nProactive problem-solving skills with a keen attention to detail.\nProficiency in data processing, analytical skills, as well as negotiation and presentation skills.\nExperience with cloud platforms (e.g., AWS, Azure, GCP).\nExperience with data warehousing and data modeling concepts.\nExperience with machine learning or artificial intelligence is a plus.\n\nWhy you'll love working here\n\n100% salary on your probation period. \n15 full-paid days off per year. \n13th-month bonus salary. \nRoom to grow with support from the team and sponsorship for L&D.\nPerformance review 2 times/year.\nCompetitive packages.\nRoom to grow professionally, sponsorship for learning & development of related skills.\nOpportunity to work on a mission that can transform the lives of millions of Vietnamese.\nAnnual Performance Bonuses (up to 2 salary months per year).\nParking fee & Lunch allowance.\nAnnual Health Checkup, Premium Health Care (Manager level), Accident Insurance for all members.\nEnjoy a variety of corporate events, from sports competitions, monthly birthday parties, and team building to Year-End Party, etc.\nFlat, open, and fast-paced environment where every idea is welcomed.\n\nSimple Tech Investment\n\n   Simple Tech Investment\n  \n\n    Company type \n   \n\n    IT Product \n   \n\n    Company industry \n   \n\n     N/A \n    \n\n    Company size \n   \n\n    301-500 employees \n   \n\n    Country \n   \n\n     Vietnam\n    \n\n    Working days \n   \n\n    Monday - Friday \n   \n\n    Overtime policy \n   \n\n    No OT\n   \n\n",
        "jd_num_tokens": 478
    },
    "ML Engineer - Enterprise Artificial Intelligence @ Renesas Electronics": {
        "id": 30,
        "title": "ML Engineer - Enterprise Artificial Intelligence",
        "company": "Renesas Electronics",
        "jd_text": "\nCompany Description\n Renesas is one of the top global semiconductor companies in the world. We strive to develop a safer, healthier, greener, and smarter world, and our goal is to make every endpoint intelligent by offering product solutions in the automotive, industrial, infrastructure and IoT markets. Our robust product portfolio includes world-leading MCUs, SoCs, analog and power products, plus Winning Combination solutions that curate these complementary products. We are a key supplier to the world’s leading manufacturers of electronics you rely on every day; you may not see our products, but they are all around you.\n Renesas employs roughly 21,000 people in more than 30 countries worldwide. As a global team, our employees actively embody the Renesas Culture, our guiding principles based on five key elements: Transparent, Agile, Global, Innovative, and Entrepreneurial. Renesas believes in, and has a commitment to, diversity and inclusion, with initiatives and a leadership team dedicated to its resources and values. At Renesas, we want to build a sustainable future where technology helps make our lives easier. Join us and build your future by being part of what’s next in electronics and the world.\n About this role\n As an AI/ML Engineer, you will design and develop scalable and reliable artificial intelligence and machine learning models for various domains and applications.\n About our team\n Our global AI, Data & Analytics Division at Renesas is experiencing an increasing demand for AI and Generative AI (LLM) based solutions. Working closely with our business partners, we deliver AI solutions to help drive value for Renesas at a global enterprise scale. We are seeking passionate candidates that will thrive as part of a global team of technologists that love empowering customers, collaborating with teammates, and using the latest AI and Data technologies. Job Description\n Responsibilities\n\n Train, evaluate, and deploy AI/ML models using Databricks MLflow\n Prepare and augment training datasets for models\n Develop AI and LLM solutions based on business requirements using approaches such as RAG architecture on enterprise data\n Collaborate with data scientists and Full stack ai engineers, and domain experts on cross-functional projects using Databricks Workspaces\n Research and evaluate new AI/ML technologies and Databricks best practices\n\n  Qualifications\n Must Have\n\n Bachelor's degree or higher in computer science, statistics, mathematics, or a related field\n 2+ years of hands-on development experience, using typical machine learning and data science tools such as pandas, scikit-learn, and TensorFlow/PyTorch\n Experience with the latest techniques in natural language processing including vector databases, computer vision processing, fine-tuning LLMs, and deploying LLMs with tools such as HuggingFace, Langchain, and OpenAI, etc.\n Familiarity with Databricks products and services\n Have working knowledge of CI/CD\n Effective communication, documentation, and white-boarding skills\n Strong interest in collaboration, learning, and driving value through ML\n\n  Additional Information\n Strongly Preferred\n\n Databricks certifications\n Experience in building and deploying AI/ML models using Databricks products\n Working knowledge of at least one major cloud ecosystem (Azure, AWS, or GCP): Azure is preferred\n Knowledge in LLM use cases such as RAG\n Experience working with a geographically distributed and cross-functional team including systems integrators and third-party companies\n\n Renesas Electronics Corporation empowers a safer, smarter and more sustainable future where technology helps make our lives easier. The leading global provider of microcontrollers, Renesas combines our expertise in embedded processing, analog, power and connectivity to deliver complete semiconductor solutions. These Winning Combinations accelerate time to market for automotive, industrial, infrastructure and IoT applications, enabling billions of connected, intelligent devices that enhance the way people work and live. Learn more at www.renesas.com.\n Renesas’ mission, To Make Our Lives Easier, is underpinned by our company culture, TAGIE. TAGIE stands for Transparent, Agile, Global, Innovative and Entrepreneurial. Our goal is to embed this unique culture in everything we do to succeed as a company and create trust with our diverse colleagues, customers and stakeholders.\n Renesas Electronics is an equal opportunity and affirmative action employer, committed to supporting diversity and fostering a work environment free of discrimination on the basis of sex, race, religion, national origin, gender, gender identity, gender expression, age, sexual orientation, military status, veteran status, or any other basis protected by law. For more information, please read our Diversity & Inclusion Statement.\n",
        "jd_num_tokens": 685
    },
    "iOS Developer - Freelancer, Remote, Flex-time, 20+ hours/week @ OpenTrain AI": {
        "id": 31,
        "title": "iOS Developer - Freelancer, Remote, Flex-time, 20+ hours/week",
        "company": "OpenTrain AI",
        "jd_text": "Job Title: Swift Developers - AI Training Data\nLocation: Remote\nJob Type: Freelance\nPay range: 150,000 VND to 350,000 VND per hour\nSchedule: 20 to 40 hours per week, with greater availability preferred.\nDuration: 6+ months\nJob Description:We are seeking skilled iOS Developers to join our team on a freelance basis. This remote position offers the flexibility to work from anywhere on your own schedule. You will be working on cutting-edge AI projects, engaging with AI tools to provide prompts and refine their output. This role not only involves writing and improving Swift code but also offers a unique opportunity to gain valuable experience in AI development—an increasingly vital skill in the tech industry that can significantly enhance your career prospects.\nResponsibilities:\n\nGenerate high-quality Swift code in response to given prompts, mimicking the output expected from an advanced AI model.\nReview and rate Swift code generated by AI models to ensure accuracy, efficiency, and adherence to best practices.\nIdentify issues and make improvements to code generated by AI models, enhancing the AI’s performance and reliability.\nCollaborate with AI researchers and other developers to refine training methods and contribute to the AI’s learning process.\n\nQualifications:\n\nBachelor’s or Master’s degree in Computer Science or related field.\nAt least 2-3 years of experience in iOS development, including building and launching apps for iPhone or iPad.\nProficient in Swift, SwiftUI, or Objective-C.\nAttention to detail and a commitment to delivering high-quality work.\nFamiliar with Apple’s design principles and interface guidelines.\nCapable of producing high-quality results independently.\nPrevious experience in writing for AI model training is an advantage.\nStrong research skills and clear communication abilities.\n\nCompensation:\n\nHigh pay range from 150,000 VND to 350,000 VND per hour, depending on experience and commitment.\nThis is a long-term freelance role requiring a commitment of 20 to 40 hours per week, with greater availability preferred.\n\nAbout the Company:OpenTrain AI leverages the power of artificial intelligence to develop practical, user-friendly AI solutions that are at the forefront of technological innovation. Our team is committed to pushing the boundaries of what AI can achieve, focusing on creating robust AI systems that can understand and interact with the world in ways previously unimaginable.\nApplication Process:To apply for this position, please visit https://www.opentrain.ai/become-freelancer and create an account. Once registered, navigate to the \"Find Jobs\" tab where you can submit your proposal and pricing bid for the role. We look forward to reviewing your application and potential contributions to our groundbreaking projects.\nJob Types: Full-time, Part-time\nPay: 150,000₫ - 350,000₫ per hour\nExpected hours: 20 – 50 per week\nExperience:\n\nSwift Development: 2 years (Required)\n\nLanguage:\n\nEnglish (Required)\n",
        "jd_num_tokens": 435
    },
    "Collection Strategy Manager @ FLOW": {
        "id": 32,
        "title": "Collection Strategy Manager",
        "company": "FLOW",
        "jd_text": "\nCompany Description\n FLOW is a one-stop, digital credit management company with the mission to promote ethical and responsible collection in Asia, through customer-centric operational processes integrated with artificial intelligence technologies.\n We work with global banks, multi-financial institutions, and enterprise companies to recover millions effectively. We understand the challenges both our clients and consumers face when it comes to debt collection and provide support at every stage of the collection lifecycle.\n Backed by DEG, SIG, and Integra Partners, FLOW is a leader in ethical, digital collections in Asia, disrupting a multibillion-dollar global industry in non-performing consumer loans. Headquartered in Singapore, we also have offices in the emerging markets of India, Indonesia, and Vietnam. Job Description\n Core Responsibilities\n\n Based on insights provided by stakeholders (CMS & PD heads, Risk, Sales, PM, AI), develop the collection strategy logics including actions, channels, content, and intensity,\n Work closely with collection strategy support unit on strategy implementation and execution control,\n Ensure strategy localization and personalization for particular partner/portfolio\n Based on insights from the call center and partner requirements, initiate strategy changes/creation and manage the implementation upon Risk’s approval\n Build collection strategy function (processes, knowledge base, reporting)\n Create Content Strategy for different Collections Tools (Script, SMS, IVR, AND/OR Emails)\n\n  Qualifications\n Qualifications & Skills\n At least 5 years of relevant experience in the Retail Banking / Financial / Debt Collection sector,\n Bachelor’s Degree in the fields of Engineering, Finance, Banking, or equivalent,\n Ability to derive insights from quantitative reports,\n Meticulous and analytical,\n Strong interpersonal and communication skills,\n Strong project management skills,\n Experience with credit risk management and business intelligence will be highly advantageous,\n Proficiency in English is a must Additional Information\n Salary & Benefits\n You will get the opportunity to work in a dynamic start-up environment to grow and develop your skills.\n\n Annual leave,\n 13th month salary,\n Annual bonus tied to KPI fulfillment,\n Health insurance,\n Well-furnished and modern office in Ho Chi Minh City,\n Training and development programs for continuous learning,\n Ability to make flexible work arrangements or conduct remote work,\n A meaningful career to better the lives of others,\n Opportunities to advance your career horizontally and vertically.\n\n Our Values\n We believe that our core values are essential for cultivating a cohesive and high-performing work environment in the company. More importantly, our values reflect our vision of the community that we are striving to foster.\n\n Ethical\n   \n Understanding the importance of our communities through responsible and moral decisions and actions.\n\n Innovation\n   \n Seeking and applying new ideas to ensure efficiency, quality, and the readiness to address current and future needs.\n\n Integrity\n   \n Being truthful, sincere, and free of deceit in our words, actions, and all business dealings.\n\n Teamwork\n   \n Respecting the people in our team and our common goals by ensuring the cultivation of a collaborative and vibrant environment.\n\n Humility\n   \n Remaining grounded to reality regardless of our statuses to recognize the strengths and potential of others.\n\n",
        "jd_num_tokens": 474
    },
    "Sale Executive @ Halocom Digital - Advertising Agency": {
        "id": 33,
        "title": "Sale Executive",
        "company": "Halocom Digital - Advertising Agency",
        "jd_text": "Company Summary\nHalocom is a start-up that specializes in digital marketing applications. Halocom is a Digital Marketing Intelligence Platform that combines modern technologies with flexibility and reliability for entrepreneurs. Through the Halocom platform, we always strive to maximize the use of Artificial Intelligence, especially Machine Learning, in Digital Marketing. To meet the promotional needs of entrepreneurs, Halocom will automatically implement and optimize marketing campaigns using suitable approaches and channels. The method is well-organized and controlled, allowing our clients to save time and money.\nWe always provide a motivating work climate at Halocom that encourages employees to show off their full potential, reflect on their work, and generate more value for both themselves and Halocom.\nThe Perfect Candidate:\n\nProven track record in Sales with a focus on achieving and exceeding targets.\nGeneral expertise in Digital Marketing, with the ability to leverage this knowledge to drive sales.\nExceptional interpersonal, communication, persuasion, and analytical skills.\nBring a positive, energetic, and optimistic approach to the team.\nEager to learn, grow, and push beyond comfort zones.\nPreferably working experience with SMEs clients.\n\nYour Role:\n\nDevelop and execute a robust sales plan, including quarterly, monthly, and weekly targets.\nDrive the entire sales process from prospecting to closing, consistently meeting or surpassing company goals.\nProactively identify and pursue new business opportunities through strategic networking and relationship-building.\nServe as the primary point of contact between clients and our agency, offering support and consultation to maximize customer satisfaction and loyalty.\nOther tasks according to assignment from your direct report.\n\nWhat you get:\n\nHighly competitive compensation\nHaving opportunity to work with dynamic team and motivated working conditions;\nTraining about Digital Advertising;\nPerformance review every 6 months;\nAllowance: Lunch, tel Card,…\nA chance to learn more about management, leadership, entrepreneurship and technical area of digital marketing;\nSocial insurance, medical insurance and unemployment insurance according to the Labor Law;\nFrequent company gatherings;\n13th salary.\n\nCONTACT\nEmail: contact@halocom.io\nWebsite: https://halocom.io/\nAddress: Level 2 – Songdo Tower, 62A Pham Ngoc Thach Street, Vo Thi Sau Ward, District 3, Ho Chi Minh City, Vietnam\nWorking time: Monday – Friday: 09h00 – 18h00; Saturday (WFH): 10h00 – 15h00; Break lunch: 1h\nJob Type: Full-time",
        "jd_num_tokens": 358
    },
    "Operations Business Analyst @ FLOW": {
        "id": 34,
        "title": "Operations Business Analyst",
        "company": "FLOW",
        "jd_text": "\nCompany Description\n FLOW is a one-stop, digital credit management company with the mission to promote ethical and responsible collection in Asia, through customer-centric operational processes integrated with artificial intelligence technologies.\n We work with global banks, multi-financial institutions, and enterprise companies to recover millions effectively. We understand the challenges both our clients and consumers face when it comes to debt collection and provide support at every stage of the collection lifecycle.\n Backed by DEG, SIG, and Integra Partners, FLOW is a leader in ethical, digital collections in Asia, disrupting a multibillion-dollar global industry in non-performing consumer loans. Headquartered in Singapore, we also have offices in the emerging markets of India, Indonesia, and Vietnam. Job Description\n Core Responsibilities\n\n Analyzing client portfolios in detail and providing regular updates of performance and potential improvement areas,\n Troubleshoot any technical difficulties/issues raised by partner / seller in collaboration with operations,\n Increasing revenue from each partner / seller by providing value added service,\n Makes recurrent performance and productivity analysis using existing reports in MIS,\n Prepares an ad hoc analysis for OPS management team upon the request, works with MIS team on preparing the numbers,\n Provides the OPS management team with regular analytical notes with insights and findings,\n Collect the status updates from Call Centre Heads and track the plans/ targets achievement,\n Proactive in looking at opportunity based on data that is managed to improve month on month performance of the call center.\n Weekly review on portfolio behavior / health check and analysis on performance trajectory.\n\n  Qualifications\n Qualifications & Skills\n\n 1 to 2 years of experience in a quantitative / analytical role within the operations division of a collections call center,\n Good presentation skills,\n Quantitatively savvy,\n Strong interpersonal skills,\n Strategic-thinking, analytical, and results-oriented,\n Holds a Degree in Engineering, Economics, Business, Accounting, or similar, from a reputable university,\n Proficient in Vietnamese and English,\n Knowledge of the CRM / Debt Collection industry will be considered an advantage.\n\n  Additional Information\n Salary & Benefits\n\n Competitive salary package,\n Annual leave,\n Training and development programs for continuous learning,\n Ability to make flexible work arrangements or conduct remote work,\n Company events and activities to meet colleagues from other countries,\n A meaningful career to better the lives of others,\n Opportunities to advance your career horizontally and vertically.\n\n Our Values We believe that our core values are essential for cultivating a cohesive and high-performing work environment in the company. More importantly, our values reflect our vision of the community that we are striving to foster.\n\n Ethical\n\n Understanding the importance of our communities through responsible and moral decisions and actions.\n\n Innovation\n\n Seeking and applying new ideas to ensure efficiency, quality, and the readiness to address current and future needs.\n\n Integrity\n\n Being truthful, sincere, and free of deceit in our words, actions, and all business dealings.\n\n Teamwork\n\n Respecting the people in our team and our common goals by ensuring the cultivation of a collaborative and vibrant environment.\n\n Humility\n\n Remaining grounded to reality regardless of our statuses to recognize the strengths and potential of others.\n\n",
        "jd_num_tokens": 495
    },
    "Head of Call Collection (Credit Management Services) @ FLOW": {
        "id": 35,
        "title": "Head of Call Collection (Credit Management Services)",
        "company": "FLOW",
        "jd_text": "\nCompany Description\n FLOW is a one-stop, digital credit management company with the mission to promote ethical and responsible collection in Asia, through customer-centric operational processes integrated with artificial intelligence technologies.\n We work with global banks, multi-financial institutions, and enterprise companies to recover millions effectively. We understand the challenges both our clients and consumers face when it comes to debt collection and provide support at every stage of the collection lifecycle.\n Backed by DEG, SIG, and Integra Partners, FLOW is a leader in ethical, digital collections in Asia, disrupting a multibillion-dollar global industry in non-performing consumer loans. Headquartered in Singapore, we also have offices in the emerging markets of India, Indonesia, and Vietnam. Job Description\n Core Responsibilities\n\n Lead, manage, and control the CMS call center teams across our operating countries in the APAC region,\n Motivate and develop the middle managers (supervisors and team leaders) to build up their people management capabilities and guide their executional efficiency,\n Coordinate with other departments to address capacity gaps, partner requirements, and assist in the management of external vendors (providing support and control to our admin team).\n Analyze relevant collection and operational metrics to manage CMS efficiency improvement end-to-end,\n Initiate and coordinate initiatives for strategy improvements for CMS to ensure the timely delivery of said initiatives and the optimization of gross margins,\n Manage business processes development and improvement in CMS,\n Represent the OPS department in communications with CMS partners, if required.\n\n  Qualifications\n Qualifications & Skills\n\n At least 8 years of experience in managing operations in a collection or call center environment in an Asian market (international / regional experience would be an advantage),\n Possesses a bachelor’s degree in business / commerce, science, engineering, or equivalent,\n Prior experience in managing operations across multiple countries would be a huge advantage,\n Excellent people management and leadership skills,\n Strong written and verbal communication skills,\n High level of responsibility and self-motivation,\n Fluent and proficient in the English language,\n Additional linguistic proficiency in Vietnamese or Bahasa would be a plus.\n\n  Additional Information\n Salary & Benefits\n You will get the opportunity to work in a dynamic start-up environment to grow and develop your skills.\n\n 24 days of annual leave,\n 13th month salary,\n Annual bonus tied to KPI fulfillment,\n Health insurance,\n Well-furnished and modern office in Ho Chi Minh City,\n Training and development programs for continuous learning,\n Ability to make flexible work arrangements or conduct remote work,\n A meaningful career to better the lives of others,\n Opportunities to advance your career horizontally and vertically.\n\n Our Values\n We believe that our core values are essential for cultivating a cohesive and high-performing work environment in the company. More importantly, our values reflect our vision of the community that we are striving to foster.\n\n Ethical\n   \n Understanding the importance of our communities through responsible and moral decisions and actions.\n\n Innovation\n   \n Seeking and applying new ideas to ensure efficiency, quality, and the readiness to address current and future needs.\n\n Integrity\n   \n Being truthful, sincere, and free of deceit in our words, actions, and all business dealings.\n\n Teamwork\n   \n Respecting the people in our team and our common goals by ensuring the cultivation of a collaborative and vibrant environment.\n\n Humility\n   \n Remaining grounded to reality regardless of our statuses to recognize the strengths and potential of others.\n\n",
        "jd_num_tokens": 534
    }
}